{"bill":{"bill_id":1647039,"change_hash":"9e06c74c670b31bdfdac3478fc4814e4","session_id":2034,"session":{"session_id":2034,"state_id":37,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Legislative Measures"},"url":"https:\/\/legiscan.com\/OR\/bill\/HB2256\/2023","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Measures\/Overview\/HB2256","completed":0,"status":1,"status_date":"2023-01-09","progress":[{"date":"2023-01-09","event":1},{"date":"2023-01-16","event":9}],"state":"OR","state_id":37,"bill_number":"HB2256","bill_type":"B","bill_type_id":"1","body":"H","body_id":81,"current_body":"H","current_body_id":81,"title":"Relating to juvenile offender sentencing.","description":"Repeals requirement for court to include in judgment document age of defendant at time of committing offense if defendant is sentenced to term of incarceration and physical custody of defendant is related to age of defendant at time of committing offense. Repeals requirement for court to include in judgment document age of defendant at time of committing offense if defendant is sentenced to term of incarceration and physical custody of defendant is related to age of defendant at time of committing offense. Repeals direction to Department of Corrections to transfer person sentenced to term of incarceration for offense committed when person was under 18 years of age to physical custody of Oregon Youth Authority even if criminal proceedings were initiated after person attained 18 years of age. Restores mandatory adult prosecution for certain offenses committed when person charged is 15, 16 or 17 years of age at time of offense. Requires juvenile court, upon filing by state of motion requesting waiver hearing, to hold hearing to determine whether person should be prosecuted as adult. Repeals eligibility of juvenile offender charged with offense subject to mandatory minimum sentence for conditional release hearing after serving at least one-half of sentence imposed. Repeals eligibility for conditional release hearing of person in custody of Oregon Youth Authority for offense committed while person was under 18 years of age, for which person was sentenced to term of imprisonment with projected release date that falls after person attains 25 years of age but before person attains 27 years of age. Repeals prohibition on person who was under 18 years of age at time of committing offense being sentenced to life imprisonment without possibility of release or parole. Repeals requirement for court to consider certain factors when sentencing person who was under 18 years of age at time of committing offense. Repeals prohibition on court considering age as aggravating factor. Repeals direction to court to include in judgment document fact that person is eligible for hearing and release after serving 15 years of sentence of imprisonment. Repeals process for hearing with State Board of Parole and Post-Prison Supervision for persons who were under 18 years of age at time of committing offense and who have served 15 years of sentence of imprisonment. Repeals authorization for release of person on parole or post-prison supervision if certain findings are made. Repeals direction to Department of Justice to adopt model policies for providing victim notification concerning conditional release and waiver hearings. Repeals direction to district attorney victim assistance programs to provide notice to victims in accordance with model policies.","pending_committee_id":1844,"committee":{"committee_id":1844,"chamber":"H","chamber_id":81,"name":"Judiciary"},"referrals":[{"date":"2023-01-16","committee_id":1844,"chamber":"H","chamber_id":81,"name":"Judiciary"}],"history":[{"date":"2023-01-09","action":"First reading. Referred to Speaker's desk.","chamber":"H","chamber_id":81,"importance":1},{"date":"2023-01-16","action":"Referred to Judiciary.","chamber":"H","chamber_id":81,"importance":1}],"sponsors":[{"people_id":23853,"person_hash":"0a7n27fr","party_id":"2","state_id":37,"party":"R","role_id":1,"role":"Rep","name":"Kevin Mannix","first_name":"Kevin","middle_name":"L.","last_name":"Mannix","suffix":"","nickname":"","district":"HD-021","ftm_eid":5050418,"votesmart_id":0,"opensecrets_id":"","knowwho_pid":0,"ballotpedia":"Kevin_Mannix","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2627082,"date":"0000-00-00","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/OR\/text\/HB2256\/id\/2627082","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Downloads\/MeasureDocument\/HB2256\/Introduced","text_size":133148,"text_hash":"141ab8999984b8d6b24bb8172b337f38"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}