{"bill":{"bill_id":1718989,"change_hash":"61cd0b27d33cd15f879a86827e1a4adb","session_id":2034,"session":{"session_id":2034,"state_id":37,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Legislative Measures"},"url":"https:\/\/legiscan.com\/OR\/bill\/HB3428\/2023","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Measures\/Overview\/HB3428","completed":0,"status":0,"status_date":null,"progress":[],"state":"OR","state_id":37,"bill_number":"HB3428","bill_type":"B","bill_type_id":"1","body":"H","body_id":81,"current_body":"H","current_body_id":81,"title":"Relating to cannabis-related employment matters within the public health care sector.","description":"Prohibits public health care employer from denying employment to prospective employee or taking adverse employment action against existing employee solely on basis of positive drug test for cannabinoid metabolites. Prohibits public health care employer from denying employment to prospective employee or taking adverse employment action against existing employee solely on basis of positive drug test for cannabinoid metabolites. Provides circumstances under which public health care employer may take adverse employment action against employee when employer reasonably suspects employee is impaired at work. Provides remedies to employee who alleges employer violation of requirements. Requires public health care employer to establish and implement workplace policies regarding workplace impairment due to recent use of marijuana. Requires Director of Department of Consumer and Business Services, in collaboration with Commissioner of the Bureau of Labor and Industries, to establish program for investigation and nonbinding arbitration of claims of violations of provisions of Act. Requires Director of Department of Consumer and Business Services, in collaboration with Commissioner of the Bureau of Labor and Industries, to develop materials that inform and educate public health care employers on impacts to workplace resulting from recent marijuana use by employees. Requires Director of Department of Consumer and Business Services to conduct study, in collaboration with Commissioner of the Bureau of Labor and Industries and Oregon Health Authority, regarding best models for use by public health care employers in addressing workplace issues related to marijuana use and detection of impairment. Requires director to report to interim committees of Legislative Assembly related to labor and business on results of study.","pending_committee_id":0,"committee":[],"referrals":[],"history":[],"sponsors":[{"people_id":16811,"person_hash":"0qk8ua62","party_id":"1","state_id":37,"party":"D","role_id":1,"role":"Rep","name":"Robert Nosse","first_name":"Robert","middle_name":"A.","last_name":"Nosse","suffix":"Jr.","nickname":"Rob","district":"HD-042","ftm_eid":14974670,"votesmart_id":150910,"opensecrets_id":"","knowwho_pid":489955,"ballotpedia":"Rob_Nosse","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2714494,"date":"0000-00-00","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/OR\/text\/HB3428\/id\/2714494","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Downloads\/MeasureDocument\/HB3428\/Introduced","text_size":32954,"text_hash":"8c35d99930c436c38fd7904ad11ec8a6"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}