{"bill":{"bill_id":1648791,"change_hash":"6fcabf038dd2c305f701a3ebc86adc08","session_id":2034,"session":{"session_id":2034,"state_id":37,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Legislative Measures"},"url":"https:\/\/legiscan.com\/OR\/bill\/SB167\/2023","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Measures\/Overview\/SB167","completed":0,"status":1,"status_date":"2023-01-09","progress":[{"date":"2023-01-09","event":1},{"date":"2023-01-13","event":9}],"state":"OR","state_id":37,"bill_number":"SB167","bill_type":"B","bill_type_id":"1","body":"S","body_id":82,"current_body":"S","current_body_id":82,"title":"Relating to elections; declaring an emergency.","description":"Alters dates by which special district recall petitions must be filed and verified. Alters dates by which special district recall petitions must be filed and verified. Reduces number of registration cards that may be requested to 500 per individual or entity. Moves ORS 247.007 from ORS chapter 247 to ORS chapter 254. Expands languages that online voters' pamphlet can be translated into. Explicitly prohibits confidential election records and information included in Address Confidentiality Program from being released as public record or as part of lists of electors. Limits time period when political parties can request list of electors. Extends time period chief petitioners have to circulate recall petition. Requires Secretary of State to establish electronic filing system for nominating petitions and declarations of candidacy. Requires use of electronic system. Adds family members living with election workers to address disclosure exemptions. Exempts individual's signatures on signature sheets from public disclosure. Removes requirement that individuals who sign electronic signature sheets must do so in two places. Authorizes Secretary of State to alter specified language required to be placed on election documents, provided that alteration in language does not materially change meaning. Exempts certain costs from calculations on whether candidate is required to file statement of organization, establish campaign account or file required campaign finance statements. Excludes candidate debate or forum for state office from being considered candidate contribution if host uses neutral criteria, set in advance, when determining who to invite. Requires Secretary of State or Attorney General to notify subject of complaint that complaint has been filed only if secretary or Attorney General opens investigation. Declares emergency, effective on passage.","pending_committee_id":1850,"committee":{"committee_id":1850,"chamber":"S","chamber_id":82,"name":"Rules"},"referrals":[{"date":"2023-01-13","committee_id":1850,"chamber":"S","chamber_id":82,"name":"Rules"}],"history":[{"date":"2023-01-09","action":"Introduction and first reading. Referred to President's desk.","chamber":"S","chamber_id":82,"importance":1},{"date":"2023-01-13","action":"Referred to Rules.","chamber":"S","chamber_id":82,"importance":1}],"sponsors":[],"sasts":[],"subjects":[],"texts":[{"doc_id":2628836,"date":"0000-00-00","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/OR\/text\/SB167\/id\/2628836","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Downloads\/MeasureDocument\/SB167\/Introduced","text_size":120387,"text_hash":"8d718c2e34ece12c5cce5d1961d850c2"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}