{"bill":{"bill_id":1646643,"change_hash":"48b45f0b6c25f1bd8ebaa67631bc4d81","session_id":2034,"session":{"session_id":2034,"state_id":37,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Legislative Measures"},"url":"https:\/\/legiscan.com\/OR\/bill\/SB215\/2023","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Measures\/Overview\/SB215","completed":0,"status":1,"status_date":"2023-01-09","progress":[{"date":"2023-01-09","event":1},{"date":"2023-01-11","event":9}],"state":"OR","state_id":37,"bill_number":"SB215","bill_type":"B","bill_type_id":"1","body":"S","body_id":82,"current_body":"S","current_body_id":82,"title":"Relating to education; declaring an emergency.","description":"Allows Department of Education to adjust amounts charged related to distribution of agricultural products received from United States Department of Agriculture for school food programs. Allows Department of Education to adjust amounts charged related to distribution of agricultural products received from United States Department of Agriculture for school food programs. Modifies provisions related to certain reimbursements for breakfasts and lunches provided by school district, government agency or community group, as identified by State Board of Education by rule. Modifies requirements for participation in program to increase number of licensed speech-language pathologists and certified speech-language pathology assistants employed in education service districts and school districts. Authorizes Department of Education to issue subpoenas related to certain investigations. Specifies confidentiality requirements for information obtained by department during investigation. Modifies required notification by Department of Education at completion of investigation of suspected sexual conduct. Exempts documents and materials of sexual conduct investigation from public records disclosure requirements. Requires persons and entities that receive certain confidential materials related to sexual conduct investigation to retain confidentiality of materials. Directs Department of Human Services to report outcomes of certain investigations to Department of Education if investigations involve conduct committed by certain persons who are school employees, contractors, agents or volunteers. Removes Department of Transportation as state agency that is directed to cooperate with schools in operation of traffic patrol. Directs education service districts to provide technical and other assistance to school districts, certain public charter schools or, as applicable, to Youth Corrections Education Program or Juvenile Detention Education Program. Eliminates redundancies related to standards for school library programs. Directs State Board of Education to adopt specified rules related to educational standards of children receiving education in hospital facilities. Clarifies that superintendents of school districts have responsibilities related to participating in intensive program. Clarifies that Department of Education is authorized to use moneys in Early Learning Account for certain purposes. Declares emergency, effective on passage.","pending_committee_id":3184,"committee":{"committee_id":3184,"chamber":"S","chamber_id":82,"name":"Education"},"referrals":[{"date":"2023-01-11","committee_id":3184,"chamber":"S","chamber_id":82,"name":"Education"}],"history":[{"date":"2023-01-09","action":"Introduction and first reading. Referred to President's desk.","chamber":"S","chamber_id":82,"importance":1},{"date":"2023-01-11","action":"Referred to Education, then Ways and Means.","chamber":"S","chamber_id":82,"importance":1},{"date":"2023-01-19","action":"Public Hearing held.","chamber":"S","chamber_id":82,"importance":0}],"sponsors":[],"sasts":[],"subjects":[],"texts":[{"doc_id":2626688,"date":"0000-00-00","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/OR\/text\/SB215\/id\/2626688","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Downloads\/MeasureDocument\/SB215\/Introduced","text_size":91985,"text_hash":"bb2cdfa96dc7dfdaf86644a7203d1eb4"}],"votes":[],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2023-01-19","time":"15:00","location":"HR B","description":"Senate Education Public Hearing"}]}}