{"bill":{"bill_id":1648042,"change_hash":"e303910027a1f32312ea40ad0015d85f","session_id":2034,"session":{"session_id":2034,"state_id":37,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Legislative Measures"},"url":"https:\/\/legiscan.com\/OR\/bill\/SB325\/2023","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Measures\/Overview\/SB325","completed":0,"status":1,"status_date":"2023-01-09","progress":[{"date":"2023-01-09","event":1},{"date":"2023-01-12","event":9}],"state":"OR","state_id":37,"bill_number":"SB325","bill_type":"B","bill_type_id":"1","body":"S","body_id":82,"current_body":"S","current_body_id":82,"title":"Relating to the effects on adjudicated persons of adjudications for criminal acts.","description":"Prohibits licensing board, commission or agency from denying, suspending or revoking occupational or professional license solely for reason that applicant or licensee was convicted of crime or subject to qualifying juvenile adjudication that does not substantially relate to specific duties and responsibilities for which license is required. Prohibits licensing board, commission or agency from denying, suspending or revoking occupational or professional license solely for reason that applicant or licensee was convicted of crime or subject to qualifying juvenile adjudication that does not substantially relate to specific duties and responsibilities for which license is required. Specifies criteria for determining whether crime substantially relates to specific duties and responsibilities for which license is required. Specifies additional restrictions on licensing board's, commission's or agency's power to deny occupational or professional license. Permits person convicted of crime to petition licensing board, commission or agency at any time for determination as to whether conviction will prevent person from receiving occupational or professional license. Permits licensing board, commission or agency to charge reasonable fee for determination. Provides that final determination is binding upon licensing board, commission or agency unless, at time of petition, person has charges pending, failed to disclose previous crime or was convicted of crime after submitting petition. Requires notice to person before final determination that conviction will result in denial of occupational or professional license. Specifies additional rights of person and additional notice requirements. Prohibits employer, state agency or licensing board from taking certain actions on basis of record created or maintained under jurisdiction of juvenile court. Specifies exemptions. Provides that adjudication that youth is within jurisdiction of juvenile court does not forfeit any right or privilege or operate as disqualification from holding public office or pursuing or engaging in lawful activity, occupation, profession or calling. Provides that information about act committed by youth or adjudicated youth may be disclosed to victim of act and to and among law enforcement unit, district attorney, county juvenile authority and certain other entities.","pending_committee_id":1846,"committee":{"committee_id":1846,"chamber":"S","chamber_id":82,"name":"Judiciary"},"referrals":[{"date":"2023-01-12","committee_id":1846,"chamber":"S","chamber_id":82,"name":"Judiciary"}],"history":[{"date":"2023-01-09","action":"Introduction and first reading. Referred to President's desk.","chamber":"S","chamber_id":82,"importance":1},{"date":"2023-01-12","action":"Referred to Judiciary.","chamber":"S","chamber_id":82,"importance":1}],"sponsors":[],"sasts":[],"subjects":[],"texts":[{"doc_id":2628086,"date":"0000-00-00","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/OR\/text\/SB325\/id\/2628086","state_link":"https:\/\/olis.oregonlegislature.gov\/liz\/2023R1\/Downloads\/MeasureDocument\/SB325\/Introduced","text_size":62814,"text_hash":"267e1e5c5f949cdc5a3f0f0c8ea86ee7"}],"votes":[],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2023-02-21","time":"13:00","location":"HR D","description":"Senate Judiciary Public Hearing"}]}}