{"bill":{"bill_id":1686032,"change_hash":"1d1ff4518052d99ef3802f1cce80caa9","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB1577\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=1577&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-01-30","progress":[{"date":"2023-01-30","event":1},{"date":"2023-01-31","event":9}],"state":"IL","state_id":13,"bill_number":"HB1577","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"COVID-19 RELIGIOUS EXEMPTION","description":"Creates the COVID-19 Religious Exemption Act. Provides that it shall be unlawful for any person, public or private institution, or public official to discriminate against any person in any manner because of such person's refusal to obtain, receive, or accept a COVID-19 vaccination contrary to his or her belief. Requires all health care facilities to adopt written access to care and information protocols that are designed to ensure that belief-based objections do not cause impairment of patients' health and that explain how belief-based objections will be addressed in a timely manner to facilitate patient care. Provides that it is unlawful for any public or private employer, entity, agency, institution, official, or person to deny admission because of, to place any reference in its application form concerning, to orally question about, to impose any burdens in terms or conditions of employment on, or to otherwise discriminate against, any applicant, in terms of employment, admission to or participation in any programs for which the applicant is eligible, or to discriminate in relation thereto, in any other manner, on account of the applicant's refusal to obtain, receive, or accept a COVID-19 vaccination that is against the applicant's beliefs. Provides that it is unlawful for any public official, guardian, agency, institution, or entity to deny any form of aid, assistance, or benefits, or to condition the reception in any way of any form of aid, assistance, or benefits, or in any other manner to coerce, disqualify, or discriminate against any person, otherwise entitled to such aid, assistance, or benefits, because that person refuses to obtain, receive, or accept a COVID-19 vaccination contrary to the person's belief. Allows any person injured by any public or private person, association, agency, entity, or corporation by reason of any action prohibited by the Act to bring an action. Provides that a person who brings an action shall recover threefold the actual damages, the costs of the action, and reasonable attorney's fees, but in no case shall recovery for each violation be less than $2,500 plus costs of the action and reasonable attorney's fees. Makes other changes. Effective immediately.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-01-31","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-01-30","action":"Filed with the Clerk by Rep. Adam M. Niemerg","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-01-31","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-01-31","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":22579,"person_hash":"3udqs3xn","party_id":"2","state_id":13,"party":"R","role_id":1,"role":"Rep","name":"Adam Niemerg","first_name":"Adam","middle_name":"M.","last_name":"Niemerg","suffix":"","nickname":"","district":"HD-109","ftm_eid":48524812,"votesmart_id":188124,"opensecrets_id":"","knowwho_pid":724176,"ballotpedia":"Adam_Niemerg","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2669850,"date":"2023-01-30","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB1577\/id\/2669850","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB1577.htm","text_size":30145,"text_hash":"34eee6d0ec7fddea392f163cc23c234c"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}