{"bill":{"bill_id":1700579,"change_hash":"4fa11ca4ed19dd40caec8272fdd8d8a8","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB2245\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2245&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-08","progress":[{"date":"2023-02-08","event":1},{"date":"2023-02-14","event":9}],"state":"IL","state_id":13,"bill_number":"HB2245","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"VEH CD-STOLEN VEHICLE HOTLINES","description":"Amends the Illinois Vehicle Code. Provides that in a county having a population of 3,000,000 or more, the county sheriff shall establish with other law enforcement agencies a vehicle theft hotline to facilitate the location of stolen vehicles via their installed existing global positioning systems, collaborate with vehicle manufacturers and dealers to provide information and assistance to law enforcement officers in the investigation of vehicle theft, and ensure that consumers are provided with information concerning the hotline and any new or used vehicle manufactured with a global positioning system by publishing the information in a conspicuous location on the county sheriff's website. Provides that the manufacturer of any vehicle sold in this State shall establish a hotline available to State, county, and local law enforcement agencies exclusively for the purposes of law enforcement information sharing and the electronic tracking of vehicles stolen in vehicular hijacking incidents or that have been used in the commission of kidnapping, aggravated battery with a firearm, attempted homicide, or homicide. Provides that the manufacturer's hotline shall relay vehicle location information, including real-time vehicle location information whenever possible, to the 9-1-1 call center or designated dispatch center for the responding agency, to the best of the manufacturer's technical capability. Requires State, county, and local law enforcement agencies to use their respective 9-1-1 system call centers or designated dispatch centers for the purpose of verification of law enforcement officers' identities and bona fide incident report numbers related to incidents. Requires manufacturers to prepare written statements detailing tracking and disabling system capabilities and make them available to State, county, and local law enforcement agencies upon request. Requires that, if a vehicle is not subscribed to the manufacturer's tracking service, the manufacturer of any vehicle sold in this State shall waive all fees associated with initiating, renewing, reestablishing, or maintaining the location, disabling, or alert service with which the vehicle is equipped during a law enforcement response or investigation of specified offenses.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-14","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-08","action":"Filed with the Clerk by Rep. Martin J. Moylan","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-14","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-14","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":15634,"person_hash":"i6a3u1hu","party_id":"1","state_id":13,"party":"D","role_id":1,"role":"Rep","name":"Martin Moylan","first_name":"Martin","middle_name":"J.","last_name":"Moylan","suffix":"","nickname":"","district":"HD-055","ftm_eid":2815766,"votesmart_id":73453,"opensecrets_id":"","knowwho_pid":387515,"ballotpedia":"Martin_J._Moylan","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2689081,"date":"2023-02-08","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB2245\/id\/2689081","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB2245.htm","text_size":15087,"text_hash":"8459cb4b1305e1fd8943cc57ad3e3863"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}