{"bill":{"bill_id":1708698,"change_hash":"c7a5cfe98b1a00c8c1c3f852831083e2","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB2535\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2535&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-15","progress":[{"date":"2023-02-15","event":1},{"date":"2023-02-15","event":9}],"state":"IL","state_id":13,"bill_number":"HB2535","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"RAISE FAMILY CAREGIVERS ACT","description":"Creates the Recognize, Assist, Include, Support, and Engage (RAISE) Family Caregivers Act. Requires the Director of Aging, in consultation with the heads of other appropriate State agencies, to develop jointly with the Family Caregiving Advisory Council (Advisory Council) a Family Caregiving Strategy (Strategy). Requires the Director to submit the Strategy to the Senate Subcommittee on Long-Term Care and Aging and to the House Workforce Development Subcommittee, and to other State agencies responsible for carrying out family caregiver programs, and to make the Strategy publicly available on the Department on Aging's website. Provides that the Strategy shall identify recommended actions that State agencies, units of local government, communities, health care providers, long-term services and supports providers, and others are taking, or may take, to recognize and support family caregivers in a manner that reflects their diverse needs, including with respect to promoting greater adoption of person-centered and family-centered care in all health and long-term services and supports settings. Requires the Director of Aging to: (1) oversee the collection and public dissemination of certain information submitted by the Advisory Council in its initial report concerning the development, maintenance, and updating of the Strategy; (2) oversee the coordination and assessment of existing State programs and activities to recognize and support family caregivers while ensuring maximum effectiveness and avoiding unnecessary duplication; (3) develop, publish, and submit to specified committees and other State agencies, an initial Strategy that incorporates the items addressed in the Advisory Council's initial report; and other duties. Requires the Director to convene the Advisory Council to advise and provide recommendations to the Director on recognizing and supporting family caregivers. Contains provisions concerning the Advisory Council's membership, meetings, and annual reports. Provides that no additional funds are authorized to be appropriated to carry out the Act. Provides that the authority and obligations established under the Act shall terminate on the date that is 3 years after the effective date of the Act. Provides that the Act is repealed 4 years after its effective date.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-15","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-15","action":"Filed with the Clerk by Rep. Camille Y. Lilly","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-15","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-15","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":5847,"person_hash":"ofvlyc7l","party_id":"1","state_id":13,"party":"D","role_id":1,"role":"Rep","name":"Camille Lilly","first_name":"Camille","middle_name":"","last_name":"Lilly","suffix":"","nickname":"","district":"HD-078","ftm_eid":13000150,"votesmart_id":122004,"opensecrets_id":"","knowwho_pid":293933,"ballotpedia":"Camille_Y._Lilly","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2700294,"date":"2023-02-15","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB2535\/id\/2700294","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB2535.htm","text_size":40717,"text_hash":"73654ecc7835d92b05bb1eff65eb8596"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}