{"bill":{"bill_id":1708381,"change_hash":"ed7d64cba534aac0a73504c0efb18300","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB2552\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2552&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-15","progress":[{"date":"2023-02-15","event":1},{"date":"2023-02-15","event":9}],"state":"IL","state_id":13,"bill_number":"HB2552","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"UTIL-ALT RETAIL SUPPLIER","description":"Amends the Public Utilities Act. Provides that if an alternative retail electric supplier warrants to an electric utility serving more than 500,000 retail customers that the alternative retail electric supplier's customer has provided consent to access interval data, then, until either the customer contacts the alternative retail electric supplier to opt out or the customer is no longer served by the alternative retail electric supplier, an electric utility serving more than 500,000 retail customers shall electronically transmit interval meter usage data for each residential retail customer that meets certain requirements. Provides that an electric utility shall submit tariffs to the Illinois Commerce Commission for approval within 120 days after the effective date of the amendatory Act to meet the requirements and provide such services no later than June 1, 2024. Provides that an alternative retail electric supplier shall not sell interval data and allows an alternative retail supplier to license or disclose interval data under specified conditions. Provides that no costs incurred by an electric utility to provide data or services shall be paid by ratepayers. Makes other changes. Amends the Consumer Fraud and Deceptive Business Practices Act. Provides that before an alternative retail electric supplier may warrant that it has a residential customer or small commercial retail customer's express agreement to access interval data, it must make specified disclosures and obtain consent to access the interval data. Provides that an alternative retail electric supplier may refuse to enroll or disenroll a residential customer or small commercial retail customer in a product or service if the residential customer or small commercial retail customer does not provide or revokes consent. Provides that an alternative retail electric supplier shall not warrant that it has a non-residential customer's (other than a small commercial retail customer's) consent to access interval meter usage data unless the contract between the alternative retail electric supplier and the customer explicitly provides the alternative retail electric supplier with permission to access the customer's interval meter usage data. Effective immediately.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-15","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-15","action":"Filed with the Clerk by Rep. Marcus C. Evans, Jr.","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-15","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-15","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":13949,"person_hash":"i0iwjbsg","party_id":"1","state_id":13,"party":"D","role_id":1,"role":"Rep","name":"Marcus Evans","first_name":"Marcus","middle_name":"C.","last_name":"Evans","suffix":"Jr.","nickname":"","district":"HD-033","ftm_eid":16072351,"votesmart_id":140354,"opensecrets_id":"","knowwho_pid":426324,"ballotpedia":"Marcus_Evans","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2700004,"date":"2023-02-15","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB2552\/id\/2700004","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB2552.htm","text_size":129673,"text_hash":"ff60ab69b0958842ca4e2fe7f3af2af7"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}