{"bill":{"bill_id":1708401,"change_hash":"be719f58726e555bd2b42887d829a90d","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB2537\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2537&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-15","progress":[{"date":"2023-02-15","event":1},{"date":"2023-02-15","event":9}],"state":"IL","state_id":13,"bill_number":"HB2537","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"BANKING-VARIOUS","description":"Amends the Illinois Banking Act, the Savings Bank Act, and the Illinois Credit Union Act to provide that if a subpoena, summons, warrant, or other request for a customer's records is presented to a bank or credit union by an agency or department of the federal government, or by an officer, agent, or employee of such federal agency or department, the bank or credit union is not required to release records until the bank or credit union has been furnished with a written certification that the requesting agency or department has satisfied its obligations under the Right to Financial Privacy Act of 1978. Makes other changes. Amends the Illinois Trust and Payable on Death Accounts Act. Provides that a holder of a payment on death account may elect a per stirpes distribution option to the descendants of a natural person beneficiary if the beneficiary predeceases the last surviving holder of the account. Provides that the financial institution may rely on the account holder's written representation of the identity of the descendants of each beneficiary living at the time of the beneficiary designation, and may also rely on an affidavit executed by a natural person beneficiary or descendant of a natural person beneficiary of the last surviving holder of the account upon or after the death of the account holder that identifies the descendants of any predeceased natural person beneficiary. Provides that 100% of the account must be distributed to all beneficiaries upon the death of the last surviving holder of the account. Makes other changes. Amends the Promissory Note and Bank Holiday Act. Provides that, if the bank is going to be closed for no more than a half day to permit personnel to attend a funeral, visitation, or other memorial service held for a deceased officer, employee, or director of the bank, or a family member of such person, the bank need only notify the Secretary and post conspicuously in the lobby of any affected office or branch of the bank notice of the hours during which the bank will be closed. Requires the notification to the Secretary and posting of notice in the lobby of the office or branch to be accomplished not less than 24 hours in advance of the day during which such closing will occur.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-15","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-15","action":"Filed with the Clerk by Rep. Camille Y. Lilly","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-15","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-15","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":5847,"person_hash":"ofvlyc7l","party_id":"1","state_id":13,"party":"D","role_id":1,"role":"Rep","name":"Camille Lilly","first_name":"Camille","middle_name":"","last_name":"Lilly","suffix":"","nickname":"","district":"HD-078","ftm_eid":13000150,"votesmart_id":122004,"opensecrets_id":"","knowwho_pid":293933,"ballotpedia":"Camille_Y._Lilly","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2700025,"date":"2023-02-15","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB2537\/id\/2700025","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB2537.htm","text_size":244822,"text_hash":"add7844fb35d9015f1521c3e023f74b0"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}