{"bill":{"bill_id":1708923,"change_hash":"58aa0c8a198ab6f03872ae8f30215e3e","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB2724\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2724&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-15","progress":[{"date":"2023-02-15","event":1},{"date":"2023-02-16","event":9}],"state":"IL","state_id":13,"bill_number":"HB2724","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"SCH CD-STUDENT DISCIPLINE","description":"Amends the School Boards Article of the School Code. In provisions regarding suspension or expulsion of pupils, provides that, when expelling a student, the board shall notify the parents of the nature of the hearing and the option of retaining legal counsel. Provides that, when the suspension period is over, the pupil may return to school. Provides that for a pupil suspended due to gross disobedience or misconduct on a school bus, a written decision about whether the student can use a school bus shall be made within 15 days of the incident. Provides that a school shall offer written demonstration of remediation efforts excluding out of school suspensions. Provides that schools shall use data to track whether significant disproportionality based on race and ethnicity is occurring both in the State and in the district with respect to the incidence, duration, and type of disciplinary removals from placement, including suspensions and expulsions. Provides that, if it is determined that significant disproportionality is occurring, the school shall provide that determination for annual review and, if appropriate, revision of the policies, practices, and procedures used in disciplinary removals to ensure that the policies, practices, and procedures comply with the district's equity requirements. Provides that notice of suspension shall also include other evidence-based alternatives to suspension. Provides that when a student is suspended for more than 4 days, \"appropriate and available support services\" must include an option for automatically placing the student in an e-learning program or distance learning program through written materials if (1) the removal is for more than 5 consecutive school days; or (2) the child has been subjected to a series of removals that constitute a pattern, because the series of removals total more than 10 school days in a school year, because the child's behavior is substantially similar to the child's behavior in previous incidents that resulted in the series of removals, and because of the effects of additional factors such as the length of each removal, the total amount of time the child has been removed, and the proximity of the removals to one another.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-16","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-15","action":"Filed with the Clerk by Rep. Cyril Nichols","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-16","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-16","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":22914,"person_hash":"9e037rpv","party_id":"1","state_id":13,"party":"D","role_id":1,"role":"Rep","name":"Cyril Nichols","first_name":"Cyril","middle_name":"","last_name":"Nichols","suffix":"","nickname":"","district":"HD-032","ftm_eid":0,"votesmart_id":196166,"opensecrets_id":"","knowwho_pid":773653,"ballotpedia":"Cyril_Nichols","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2700690,"date":"2023-02-15","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB2724\/id\/2700690","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB2724.htm","text_size":117756,"text_hash":"b9cf943e60c036582fe701a2bd2366ad"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}