{"bill":{"bill_id":1710942,"change_hash":"726c3d10790d59f9d48ce2a5b64832eb","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB2843\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2843&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-16","progress":[{"date":"2023-02-16","event":1},{"date":"2023-02-16","event":9}],"state":"IL","state_id":13,"bill_number":"HB2843","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"NURSING HOME CARE-DISCLOSURE","description":"Amends the Nursing Home Care Act. Provides that a for-profit facility licensed under the Act shall disclose data regarding the lease or rental of the facility by a real estate partnership owning the facility to a business operating the facility in any cost report submitted by the facility to the State. Provides that the provisions only apply to a facility that is leased or rented by its owner to a related party of the owner. Contains specified data to be disclosed by a for-profit facility under the Act with each cost report filed with the Department of Healthcare and Family Services. Requires the information disclosed to be filed with the Department's Bureau of Health Finance within 90 days after the end of each fiscal year. Requires the Department to publish the information on its website for general viewing and in an annual report to the General Assembly. Requires the Auditor General to submit an annual audit report to the General Assembly concerning the quality of care, financial practices, and statewide oversight of Illinois' facilities. Provides that any individual who has an ownership interest in a facility that is placed on the federal Special Focus Facility List published by the Centers for Medicare and Medicaid Services or its list of candidates for that List shall not obtain an ownership interest in another facility in the State until the facility has been removed from and remains off of the Special Focus Facility List or the list of candidates for that List for a period of 2 years. Provides that, within 90 days after the effective date of the amendatory Act, all long-term care providers operating or maintaining a facility shall notify the Department of all individual owners and any individuals or organizations that are part of a limited liability company with ownership of that facility and the percentage of ownership of each owner. Provides that this ownership reporting requirement does not include individual shareholders in a publicly held corporation. Requires the Department, in collaboration with any other relevant State agency, to work to improve State data collection forms for facilities to ensure that all relevant information is provided. Provides that State regulators shall perform specified duties.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-16","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-16","action":"Filed with the Clerk by Rep. Suzanne M. Ness","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-16","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-16","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":22538,"person_hash":"qoqbg5ni","party_id":"1","state_id":13,"party":"D","role_id":1,"role":"Rep","name":"Suzanne Ness","first_name":"Suzanne","middle_name":"M.","last_name":"Ness","suffix":"","nickname":"","district":"HD-066","ftm_eid":48524776,"votesmart_id":188047,"opensecrets_id":"","knowwho_pid":724473,"ballotpedia":"Suzanne_Ness","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2703285,"date":"2023-02-16","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB2843\/id\/2703285","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB2843.htm","text_size":29732,"text_hash":"3663daf1b40176a5551c1d272d2572dd"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}