{"bill":{"bill_id":1711036,"change_hash":"9f060826e6389c62c95dbfee07d21458","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB2984\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2984&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-16","progress":[{"date":"2023-02-16","event":1},{"date":"2023-02-16","event":9}],"state":"IL","state_id":13,"bill_number":"HB2984","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"CHINESE INVESTMENTS PROHIBITED","description":"Amends the Deposit of State Moneys Act and the Public Funds Investment Act. Prohibits the investment of State moneys and public funds in certain investments or institutions tied to the Chinese Communist Party or the People's Republic of China. Amends the Procurement Code. Provides that each bid or offer submitted for a State contract shall include a disclosure of whether or not the bidder, offeror, or any of its corporate parents or subsidiaries, within the 24 months before submission of the bid or offer had business operations that involved contracts with or provision of supplies or services to the Chinese Communist Party and certain other companies tied to the Chinese Communist Party. Amends the Illinois Pension Code. Provides that the State-funded retirement systems shall not invest moneys in Chinese Communist Party sovereign debt, Chinese Communist Party-backed securities, any investment instrument issued by an entity that is domiciled or has its principal place of business in the People's Republic of China, or any investment instrument issued by a company that is subject to Chinese Military-Industrial Complex Companies Sanctions. Provides that as soon as practicable, each State-funded retirement system shall instruct its investment advisors to sell, redeem, divest, or withdraw all direct holdings of Chinese Communist Party sovereign debt and direct holdings of Chinese Communist Party-backed securities. Requires the Illinois Investment Policy Board to make its best efforts to identify all companies that are domiciled or have their principal place of business in the People's Republic of China and companies subject to Chinese Military-Industrial Complex Companies Sanctions and to include those companies in the list of restricted companies. Makes other changes. Amends the Board of Higher Education Act. Provides that the Board of Higher Education shall require a public institution of higher education to disclose to the Board any endowment or other donation given to the institution from a source associated with any company that is domiciled or has its principal place of business in the People's Republic of China and is on the list of restricted companies developed by the Illinois Investment Policy Board. Makes other changes.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-16","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-16","action":"Filed with the Clerk by Rep. Blaine Wilhour","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-16","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-16","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":20900,"person_hash":"udvk6i3p","party_id":"2","state_id":13,"party":"R","role_id":1,"role":"Rep","name":"Blaine Wilhour","first_name":"Blaine","middle_name":"","last_name":"Wilhour","suffix":"","nickname":"","district":"HD-107","ftm_eid":44164210,"votesmart_id":89502,"opensecrets_id":"","knowwho_pid":645583,"ballotpedia":"Blaine_Wilhour","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2703373,"date":"2023-02-16","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB2984\/id\/2703373","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB2984.htm","text_size":106479,"text_hash":"d3651bfce808d2375b9f2db51a9e4ee5"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}