{"bill":{"bill_id":1711768,"change_hash":"319c6d7443721310c5a2232ed581cc12","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB3226\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=3226&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-16","progress":[{"date":"2023-02-16","event":1},{"date":"2023-02-17","event":9}],"state":"IL","state_id":13,"bill_number":"HB3226","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"VETERANS I.O.U. ACT","description":"Creates the Veterans I.O.U. Act. Provides that the General Assembly finds that veterans are owed a debt of gratitude for their service; that there is a known and large gap between veterans and their awareness of the resources, services, and benefits available to them, especially in times of need; and that closing this gap begins with being able to identify a veteran, which can eliminate the disconnect between a veteran and the resources, services, and benefits the veteran may need. Requires the Department of Veterans' Affairs to develop, by rule, standards for identifying veterans and making them aware of resources, services, and benefits that veterans may need. Provides that the rules shall require State agencies, local government agencies, as well as licensed individuals and entities, to ask an individual at the point of initial contact if the individual has ever served in any branch of the military of the United States, including the National Guard, reserve, or active duty. Defines \"points of contact\" to include, but not be limited to, stops by law enforcement, arrest and booking, emergency room visits, visits to food pantries, and visits to homeless shelters. Provides that if an individual affirmatively answers at the point of contact that the individual is a veteran, the veteran shall be offered information and outreach in accordance with the Department's standards. Requires outreach by the Department to commence within 48 hours after the initial contact and to include, but not be limited to: information regarding available resources, services, and benefits; assistance in contacting providers of the resources, services, and benefits; assistance in enrolling in the resources, services, and benefits; and where available, support for the veteran's family. Provides that outreach regarding resources, services, and benefits shall not be limited to resources of the U.S. Department of Veterans Affairs. Requires State agencies, local government agencies, and licensed individuals and entities to comply with the Department's standards that apply to them. Grants the Department rulemaking authority and requires State agencies, local government agencies, and licensed individuals and entities to comply with those rules.","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-17","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-16","action":"Filed with the Clerk by Rep. Lindsey LaPointe","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-17","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-17","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":21378,"person_hash":"1tlmtltr","party_id":"1","state_id":13,"party":"D","role_id":1,"role":"Rep","name":"Lindsey LaPointe","first_name":"Lindsey","middle_name":"","last_name":"LaPointe","suffix":"","nickname":"","district":"HD-019","ftm_eid":29477170,"votesmart_id":186840,"opensecrets_id":"","knowwho_pid":713780,"ballotpedia":"Lindsey_LaPointe","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2704280,"date":"2023-02-16","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB3226\/id\/2704280","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB3226.htm","text_size":16249,"text_hash":"ee56dc6e4c9c9126e2058d25b0d83544"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}