{"bill":{"bill_id":1711646,"change_hash":"976b5ca372fe6ae4feb19fca852f5060","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/HB3210\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=3210&GAID=17&DocTypeID=HB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-16","progress":[{"date":"2023-02-16","event":1},{"date":"2023-02-17","event":9}],"state":"IL","state_id":13,"bill_number":"HB3210","bill_type":"B","bill_type_id":"1","body":"H","body_id":35,"current_body":"H","current_body_id":35,"title":"CONTROLLED SUBSTANCES-FENTANYL","description":"Amends the Illinois Controlled Substances Act. Provides that in addition to any other penalties provided by law, a person knowingly and unlawfully selling or dispensing any scheduled drug containing a detectable amount of fentanyl is guilty of a Class X felony and shall be sentenced to a term of imprisonment of not less than 9 years and not more than 40 years or fined not more than $250,000, or both. Provides that it is a Class 1 felony for which a fine not to exceed $100,000 may be imposed for any person to knowingly use an electronic communication device in the furtherance of controlled substance trafficking involving a substance containing any amount of fentanyl. Provides that this penalty shall be in addition to any other penalties imposed by law. Provides that in addition to any other penalties imposed, not less than 6 years and not more than 30 years shall be imposed with respect to any amount of carfentanil or fentanyl, or any analog thereof, in excess of 150 milligrams that is stored or transmitted as a powder, blotter paper, tablet, patch, or spray. Provides that in addition to any other penalties imposed, with respect to fentanyl, or an analog thereof, an additional sentence of 5 years shall be imposed if the fentanyl or analog thereof is in a form that resembles, or was mixed, granulated, absorbed, adsorbed, spray-dried, aerosolized as or onto, coated on in whole or in part, or solubilized with or into, a product, where the product or its packaging further has at least one of the following attributes: (1) a resemblance to the trade dress of a consumer food product, branded food product, or logo food product, or incorporates an actual or satirical version of a registered trademark, service mark, or copyright; (2) a bright color or coloring scheme; (3) the appearance of a cereal, candy, vitamin, gummy, or chewable product such as a gum or gelatin-based product; (4) a cartoon character imprint; or (5) incorporation into a separate product or package approved by the United States Food and Drug Administration, or approved by a regulatory agency for food or drug products in another country, if the addition of fentanyl, carfentanil, or any analog thereof, would render the approved product an adulterated product under the standards of the Federal Food, Drug, and Cosmetic Act, or any law of this State or administrative rule. Defines \"electronic communication device\".","pending_committee_id":235,"committee":{"committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"},"referrals":[{"date":"2023-02-17","committee_id":235,"chamber":"H","chamber_id":35,"name":"Rules"}],"history":[{"date":"2023-02-16","action":"Filed with the Clerk by Rep. Tony M. McCombie","chamber":"H","chamber_id":35,"importance":1},{"date":"2023-02-17","action":"First Reading","chamber":"H","chamber_id":35,"importance":0},{"date":"2023-02-17","action":"Referred to Rules Committee","chamber":"H","chamber_id":35,"importance":1}],"sponsors":[{"people_id":19117,"person_hash":"ey3bt3jq","party_id":"2","state_id":13,"party":"R","role_id":1,"role":"Rep","name":"Tony McCombie","first_name":"Tony","middle_name":"M.","last_name":"McCombie","suffix":"","nickname":"","district":"HD-071","ftm_eid":38445083,"votesmart_id":166410,"opensecrets_id":"","knowwho_pid":561010,"ballotpedia":"Tony_McCombie","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2704157,"date":"2023-02-16","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/HB3210\/id\/2704157","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/HB\/10300HB3210.htm","text_size":80590,"text_hash":"94c1f2fa3d5169de625b614d01b100c8"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}