{"bill":{"bill_id":1697953,"change_hash":"4b45f3bcf23734ff5a8c40624aea8d1d","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/SB1472\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=1472&GAID=17&DocTypeID=SB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-07","progress":[{"date":"2023-02-07","event":1},{"date":"2023-02-07","event":9}],"state":"IL","state_id":13,"bill_number":"SB1472","bill_type":"B","bill_type_id":"1","body":"S","body_id":36,"current_body":"S","current_body_id":36,"title":"NONCITIZENS RIGHTS ACT","description":"Creates the Noncitizens Rights Act. Prohibits an agent or agency from requesting information about or otherwise investigating or assisting in the investigation of the citizenship or immigration status of any person unless such inquiry or investigation is required by State statute, federal regulation, or court decision. Restricts a law enforcement or other agency of the State or other local government from inquiring into the immigration status of a person who interacts with a governmental agency. Requires law enforcement and other government offices that regularly have people walk in to report violations of law or to complain about government operations to prominently post signs describing the government's policy of not asking about an individual's immigration status. Provides that no agency or assigned counsel shall disclose information regarding the citizenship or immigration status of a person unless required to do so by legal process or when such a disclosure has been authorized in writing by the individual to whom such information pertains. Allows law enforcement officers to inquire into the immigration status of a person under specified circumstances. Provides that no agent, agency, or local government employee shall condition the receipt of benefits, opportunities, or services provided by the State on matters related to citizenship or immigration status unless required to do so by statute, federal regulation, or court decision. Provides that where presentation of a State driver's license or State issued government identification card is accepted as adequate evidence of identity, presentation of photo identity documents issued by the person's nation of origin shall be accepted and shall not subject the person to a higher scrutiny or different treatment than if the person had provided a State driver's license or government identification card. Establishes prohibited State or federal agency or agent actions. Authorizes an agency or agent to communicate with ICE in order to determine whether a matter involves enforcement based solely on a violation of civil immigration law. Establishes provisions related to liability and remedies for violations of the Act. Sets forth requirements for the removal of files maintained by agencies when such files contain information regarding citizenship or immigration status.","pending_committee_id":254,"committee":{"committee_id":254,"chamber":"S","chamber_id":36,"name":"Assignments"},"referrals":[{"date":"2023-02-07","committee_id":254,"chamber":"S","chamber_id":36,"name":"Assignments"}],"history":[{"date":"2023-02-07","action":"Filed with Secretary by Sen. Rachel Ventura","chamber":"S","chamber_id":36,"importance":1},{"date":"2023-02-07","action":"First Reading","chamber":"S","chamber_id":36,"importance":0},{"date":"2023-02-07","action":"Referred to Assignments","chamber":"S","chamber_id":36,"importance":1}],"sponsors":[{"people_id":24168,"person_hash":"snpzcogi","party_id":"1","state_id":13,"party":"D","role_id":2,"role":"Sen","name":"Rachel Ventura","first_name":"Rachel","middle_name":"","last_name":"Ventura","suffix":"","nickname":"","district":"SD-043","ftm_eid":55357273,"votesmart_id":187974,"opensecrets_id":"","knowwho_pid":0,"ballotpedia":"Rachel_Ventura","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2685294,"date":"2023-02-07","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/SB1472\/id\/2685294","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/SB\/10300SB1472.htm","text_size":32549,"text_hash":"d5f8bcb2ab5f81ec86c7e5a40a6ca4bf"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}