{"bill":{"bill_id":1702211,"change_hash":"ca71e4c9d3ab87415e45c1286d683576","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/SB1999\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=1999&GAID=17&DocTypeID=SB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-09","progress":[{"date":"2023-02-09","event":1},{"date":"2023-02-09","event":9}],"state":"IL","state_id":13,"bill_number":"SB1999","bill_type":"B","bill_type_id":"1","body":"S","body_id":36,"current_body":"S","current_body_id":36,"title":"ABANDONED INFANTS","description":"Amends the Abandoned Newborn Infant Protection Act. Replaces all instances of \"child-placing agency\" or \"child placing agency\" with \"child welfare agency\". In provisions concerning the Department of Children and Family Services' State Central Registry of child welfare agencies willing to take legal custody of relinquished newborn infants, provides that within 3 business days after accepting a referral from the Department, the child welfare agency shall file a petition for custody and request that the agency be given the authority to place the infant in an adoptive home, foster home, child care facility, or other facility appropriate for the needs of the infant. Prohibits filing or appearance fees for the petitioner. Provides that any issued custody order shall grant the child welfare agency the authority to make medical and health-related decisions for the infant. Provides that any infant who receives emergency or medical care under the Act shall be deemed presumptively eligible for medicaid assistance under the Illinois Public Aid Code. Provides that any health care provider or child welfare agency that provides medical services to an infant under the Act shall send all bills related to those medical services directly to the Department of Healthcare and Family Services for reimbursement. Makes conforming changes to the Medical Assistance Article of the Illinois Public Aid Code. Requires the Department of Healthcare and Family Services to submit for federal approval any waiver application or State Plan amendment as may be necessary to implement the presumptive eligibility provisions of the amendatory Act. Further amends the Abandoned Newborn Infant Protection Act by requiring a fire station or emergency medical facility that accepts a relinquished infant to inform the infant's parent of the name and location of the hospital to which the infant was transported if the parent returns to reclaim the infant within 30 days (rather than 72 hours) after relinquishing the infant. Amends the Immunization Data Registry Act, the Illinois Parentage Act of 2015, and the Adoption Act by replacing instances of \"child-placing agency\" or \"child placing agency\" with \"child welfare agency\".","pending_committee_id":254,"committee":{"committee_id":254,"chamber":"S","chamber_id":36,"name":"Assignments"},"referrals":[{"date":"2023-02-09","committee_id":254,"chamber":"S","chamber_id":36,"name":"Assignments"}],"history":[{"date":"2023-02-09","action":"Filed with Secretary by Sen. Sara Feigenholtz","chamber":"S","chamber_id":36,"importance":1},{"date":"2023-02-09","action":"First Reading","chamber":"S","chamber_id":36,"importance":0},{"date":"2023-02-09","action":"Referred to Assignments","chamber":"S","chamber_id":36,"importance":1}],"sponsors":[{"people_id":1040,"person_hash":"vwdkimbw","party_id":"1","state_id":13,"party":"D","role_id":2,"role":"Sen","name":"Sara Feigenholtz","first_name":"Sara","middle_name":"","last_name":"Feigenholtz","suffix":"","nickname":"","district":"SD-006","ftm_eid":2667276,"votesmart_id":6323,"opensecrets_id":"","knowwho_pid":194298,"ballotpedia":"Sara_Feigenholtz","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2690973,"date":"2023-02-09","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/SB1999\/id\/2690973","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/SB\/10300SB1999.htm","text_size":319232,"text_hash":"64f0783b0eed0af38386087513b90126"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}