{"bill":{"bill_id":1703797,"change_hash":"7417a4f652cfcc1de84a481ff55a1625","session_id":2020,"session":{"session_id":2020,"state_id":13,"year_start":2023,"year_end":2024,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023-2024 Regular Session","session_name":"103rd General Assembly"},"url":"https:\/\/legiscan.com\/IL\/bill\/SB2258\/2023","state_link":"https:\/\/www.ilga.gov\/legislation\/BillStatus.asp?DocNum=2258&GAID=17&DocTypeID=SB&SessionID=112&GA=103","completed":0,"status":1,"status_date":"2023-02-10","progress":[{"date":"2023-02-10","event":1},{"date":"2023-02-10","event":9}],"state":"IL","state_id":13,"bill_number":"SB2258","bill_type":"B","bill_type_id":"1","body":"S","body_id":36,"current_body":"S","current_body_id":36,"title":"CD CORR-SENTENCING REVIEW","description":"Amends the Unified Code of Corrections. Provides that any person imprisoned in the penitentiary may, after serving 10 years or more of his or her sentence or cumulative sentences, submit a petition for sentencing review in the circuit court of the county in which he or she was originally sentenced. Provides that upon receipt of the petition and assignment to a judge, the judge shall determine within 30 days if the petitioner has sought filing in the appropriate court and has served 10 or more years of his or her sentence. If the court determines that either of those factors are not satisfied, it shall dismiss the petition and notify the petitioner of the reason for the dismissal. Provides that the State's Attorney must be afforded an opportunity to respond to the petition and the court shall provide the petitioner with the opportunity to reply to the petition. Provides that within 90 days after the filing of the petition for sentencing review, the court shall set the matter for a hearing. Provides that this date may be extended by motion of either party and at the court's discretion for good cause shown. Provides that at the sentencing review hearing the court shall consider certain factors. Provides that following the hearing, the court may affirm or reduce the petitioner's sentence and shall be authorized to depart downward from any mandatory minimum or mandatory sentence enhancement, taking into consideration certain mitigating factors. Provides that notwithstanding any provisions to the contrary, any offender who has petitioned the circuit court for sentencing review shall not be eligible to submit a second petition until at least 5 years have elapsed since the date on which the circuit court ruled upon the initial petition. Provides that these provisions shall operate retroactively to provide any person incarcerated for a crime or crimes committed, before the effective date of the amendatory Act, with the opportunity to file a motion for resentencing under these provisions under the terms provided in these provisions. Provides that notwithstanding anything else to the contrary, nothing in these provisions shall be construed to delay parole or mandatory supervised release consideration for petitioners who, prior to the effective date of the amendatory Act, are or will be eligible for release earlier than these provisions.","pending_committee_id":254,"committee":{"committee_id":254,"chamber":"S","chamber_id":36,"name":"Assignments"},"referrals":[{"date":"2023-02-10","committee_id":254,"chamber":"S","chamber_id":36,"name":"Assignments"}],"history":[{"date":"2023-02-10","action":"Filed with Secretary by Sen. Robert Peters","chamber":"S","chamber_id":36,"importance":1},{"date":"2023-02-10","action":"First Reading","chamber":"S","chamber_id":36,"importance":0},{"date":"2023-02-10","action":"Referred to Assignments","chamber":"S","chamber_id":36,"importance":1}],"sponsors":[{"people_id":20213,"person_hash":"r76k04os","party_id":"1","state_id":13,"party":"D","role_id":2,"role":"Sen","name":"Robert Peters","first_name":"Robert","middle_name":"","last_name":"Peters","suffix":"","nickname":"","district":"SD-013","ftm_eid":46908693,"votesmart_id":186002,"opensecrets_id":"","knowwho_pid":693823,"ballotpedia":"Robert_Peters","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2693305,"date":"2023-02-10","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/IL\/text\/SB2258\/id\/2693305","state_link":"https:\/\/www.ilga.gov\/legislation\/103\/SB\/10300SB2258.htm","text_size":36230,"text_hash":"eb937d191a6917e04d0a717adc12e3f4"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}