{"bill":{"bill_id":1630765,"change_hash":"d0fdd22f548dba3046d469f51a465766","session_id":1988,"session":{"session_id":1988,"state_id":46,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/VA\/bill\/HB1075\/2023","state_link":"https:\/\/lis.virginia.gov\/cgi-bin\/legp604.exe?231+sum+HB1075","completed":0,"status":1,"status_date":"2022-01-12","progress":[{"date":"2022-01-12","event":1},{"date":"2022-01-12","event":9}],"state":"VA","state_id":46,"bill_number":"HB1075","bill_type":"B","bill_type_id":"1","body":"H","body_id":7,"current_body":"H","current_body_id":7,"title":"Health care provider panels; vertically integrated carriers, reimbursements to providers.","description":"Health care provider panels; vertically integrated carriers; reimbursements to providers. Requires any vertically integrated carrier, upon written request, to offer participation in each requested provider panel or network established for each of the vertically integrated carrier's policies, products, and plans, including all policies, products, and plans offered to individuals, employers, and enrollees in government benefit programs, to the requesting provider under the same terms and conditions that apply to providers under common control with the vertically integrated carrier. The measure requires that the offered participation (i) be without any adverse tiering or other financial incentives that may discourage enrollees from utilizing the services of the provider, (ii) include all sites and services offered by the provider, and (iii) take into account the different characteristics of different providers with regard to the range, nature, cost, and complexity of services offered. The measure prohibits an officer or director of a vertically integrated carrier from simultaneously serving as an officer or director of an entity that owns, operates, manages, or controls an acute care hospital located, in whole or in part, in the Commonwealth. The measure defines \"vertically integrated carrier\" as a health insurer or other carrier that owns an interest in, is owned by, or is under common ownership or control with an acute care hospital facility, excluding an entity that is under the ultimate control of or under common control with a public hospital. Health care provider panels; vertically integrated carriers; reimbursements to providers. Requires any vertically integrated carrier, upon written request, to offer participation in each requested provider panel or network established for each of the vertically integrated carrier's policies, products, and plans, including all policies, products, and plans offered to individuals, employers, and enrollees in government benefit programs, to the requesting provider under the same terms and conditions that apply to providers under common control with the vertically integrated carrier. The measure requires that the offered participation (i) be without any adverse tiering or other financial incentives that may discourage enrollees from utilizing the services of the provider, (ii) include all sites and services offered by the provider, and (iii) take into account the different characteristics of different providers with regard to the range, nature, cost, and complexity of services offered. The measure prohibits an officer or director of a vertically integrated carrier from simultaneously serving as an officer or director of an entity that owns, operates, manages, or controls an acute care hospital located, in whole or in part, in the Commonwealth. The measure defines \"vertically integrated carrier\" as a health insurer or other carrier that owns an interest in, is owned by, or is under common ownership or control with an acute care hospital facility, excluding an entity that is under the ultimate control of or under common control with a public hospital.","pending_committee_id":4570,"committee":{"committee_id":4570,"chamber":"H","chamber_id":7,"name":"Commerce and Energy"},"referrals":[{"date":"2022-01-12","committee_id":4570,"chamber":"H","chamber_id":7,"name":"Commerce and Energy"}],"history":[{"date":"2022-01-12","action":"Prefiled and ordered printed; offered 01\/12\/22 22102199D","chamber":"H","chamber_id":7,"importance":0},{"date":"2022-01-12","action":"Referred to Committee on Commerce and Energy","chamber":"H","chamber_id":7,"importance":1},{"date":"2022-02-10","action":"Continued to 2023 in Commerce and Energy by voice vote","chamber":"H","chamber_id":7,"importance":0},{"date":"2022-11-22","action":"Left in Commerce and Energy","chamber":"H","chamber_id":7,"importance":0}],"sponsors":[{"people_id":16092,"person_hash":"jt8mk86u","party_id":"2","state_id":46,"party":"R","role_id":1,"role":"Rep","name":"James Leftwich","first_name":"James","middle_name":"A.","last_name":"Leftwich","suffix":"Jr.","nickname":"Jay","district":"HD-078","ftm_eid":17607895,"votesmart_id":145333,"opensecrets_id":"","knowwho_pid":469602,"ballotpedia":"Jay_Leftwich","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":9,"type":"Carry Over","sast_bill_number":"HB1075","sast_bill_id":1553866}],"subjects":[{"subject_id":231,"subject_name":"Health"},{"subject_id":240,"subject_name":"Insurance"}],"texts":[{"doc_id":2609628,"date":"2022-01-12","type":"Prefiled","type_id":11,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/VA\/text\/HB1075\/id\/2609628","state_link":"https:\/\/lis.virginia.gov\/cgi-bin\/legp604.exe?231+ful+HB1075+hil","text_size":49386,"text_hash":"ea901574be78848215f0f69ca64aecbf"}],"votes":[],"amendments":[],"supplements":[{"supplement_id":286141,"date":"2022-06-20","type":"Fiscal Note\/Analysis","type_id":3,"title":"Fiscal Note\/Analysis","description":"House: Prefiled and ordered printed; offered 01\/12\/22 22102199D","mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/VA\/supplement\/HB1075\/id\/286141","state_link":"https:\/\/lis.virginia.gov\/cgi-bin\/legp604.exe?231+oth+HB1075F122+PDF","supplement_size":85886,"supplement_hash":"23767aa5dce19adbea43da135fca893b"}],"calendar":[]}}