{"bill":{"bill_id":1630795,"change_hash":"869201778835304d5d349a05ed12d56c","session_id":1988,"session":{"session_id":1988,"state_id":46,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/VA\/bill\/HB1157\/2023","state_link":"https:\/\/lis.virginia.gov\/cgi-bin\/legp604.exe?231+sum+HB1157","completed":0,"status":1,"status_date":"2022-01-14","progress":[{"date":"2022-01-14","event":1},{"date":"2022-01-14","event":9}],"state":"VA","state_id":46,"bill_number":"HB1157","bill_type":"B","bill_type_id":"1","body":"H","body_id":7,"current_body":"H","current_body_id":7,"title":"Attorneys for the Commonwealth; compensation and collection of fees.","description":"Attorneys for the Commonwealth; compensation and collection of fees. Prohibits the Compensation Board, when determining staffing and funding levels for offices of attorneys for the Commonwealth, from (i) considering the number of charges brought or the number of convictions obtained by such attorney for the Commonwealth; (ii) relying on standards devised or recommended by the attorney for the Commonwealth, law-enforcement agencies, or professional associations representing attorneys for the Commonwealth or law-enforcement officers; or (iii) using measures that increase if an attorney for the Commonwealth (a) elects to prosecute a more serious charge, (b) elects to prosecute additional charges from a single arrest or criminal incident, (c) obtains convictions rather than dismissing charges or offering reduced charges, or (d) proceeds with prosecution rather than diversion. The bill requires attorneys for the Commonwealth to pay into the state treasury all fees collected by them in consideration of the performance of official duties or functions; current law requires the payment of half of such fees. The bill requires the State Treasurer to pay to the treasuries of the respective counties and cities of the attorneys for the Commonwealth a proportion of half of all such fees collected by all attorneys for the Commonwealth, as determined by each county or city's crime rate, criminal incident rate, or arrest rate. Finally, the bill changes the fees collected by attorneys for the Commonwealth on trials of felony indictments from $40 on each count to $120 for each trial of a Class 1 or Class 2 felony indictment, or any other felony punishable by imprisonment for life, and $40 for each trial on all other felony indictments, regardless of the number of counts. The bill contains technical amendments. Attorneys for the Commonwealth; compensation and collection of fees. Prohibits the Compensation Board, when determining staffing and funding levels for offices of attorneys for the Commonwealth, from (i) considering the number of charges brought or the number of convictions obtained by such attorney for the Commonwealth; (ii) relying on standards devised or recommended by the attorney for the Commonwealth, law-enforcement agencies, or professional associations representing attorneys for the Commonwealth or law-enforcement officers; or (iii) using measures that increase if an attorney for the Commonwealth (a) elects to prosecute a more serious charge, (b) elects to prosecute additional charges from a single arrest or criminal incident, (c) obtains convictions rather than dismissing charges or offering reduced charges, or (d) proceeds with prosecution rather than diversion. The bill requires attorneys for the Commonwealth to pay into the state treasury all fees collected by them in consideration of the performance of official duties or functions; current law requires the payment of half of such fees. The bill requires the State Treasurer to pay to the treasuries of the respective counties and cities of the attorneys for the Commonwealth a proportion of half of all such fees collected by all attorneys for the Commonwealth, as determined by each county or city's crime rate, criminal incident rate, or arrest rate. Finally, the bill changes the fees collected by attorneys for the Commonwealth on trials of felony indictments from $40 on each count to $120 for each trial of a Class 1 or Class 2 felony indictment, or any other felony punishable by imprisonment for life, and $40 for each trial on all other felony indictments, regardless of the number of counts. The bill contains technical amendments.","pending_committee_id":150,"committee":{"committee_id":150,"chamber":"H","chamber_id":7,"name":"Courts of Justice"},"referrals":[{"date":"2022-01-14","committee_id":150,"chamber":"H","chamber_id":7,"name":"Courts of Justice"},{"date":"2022-02-03","committee_id":3863,"chamber":"H","chamber_id":7,"name":"Courts: Subcommittee #3"},{"date":"2022-02-07","committee_id":150,"chamber":"H","chamber_id":7,"name":"Courts of Justice"}],"history":[{"date":"2022-01-14","action":"Presented and ordered printed 22102077D","chamber":"H","chamber_id":7,"importance":0},{"date":"2022-01-14","action":"Referred to Committee for Courts of Justice","chamber":"H","chamber_id":7,"importance":1},{"date":"2022-02-03","action":"Assigned Courts sub: Subcommittee #3","chamber":"H","chamber_id":7,"importance":0},{"date":"2022-02-04","action":"Subcommittee recommends continuing to 2023 by voice vote","chamber":"H","chamber_id":7,"importance":0},{"date":"2022-02-07","action":"Continued to 2023 in Courts of Justice by voice vote","chamber":"H","chamber_id":7,"importance":0},{"date":"2022-11-22","action":"Left in Courts of Justice","chamber":"H","chamber_id":7,"importance":0}],"sponsors":[{"people_id":16061,"person_hash":"ybv76irj","party_id":"1","state_id":46,"party":"D","role_id":1,"role":"Rep","name":"Marcus Simon","first_name":"Marcus","middle_name":"B.","last_name":"Simon","suffix":"","nickname":"","district":"HD-053","ftm_eid":15117155,"votesmart_id":144836,"opensecrets_id":"","knowwho_pid":465846,"ballotpedia":"Marcus_Simon","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[{"type_id":9,"type":"Carry Over","sast_bill_number":"HB1157","sast_bill_id":1559861}],"subjects":[{"subject_id":169168,"subject_name":"Counties Cities and Towns"},{"subject_id":175935,"subject_name":"Commonwealth's Attorneys"}],"texts":[{"doc_id":2609661,"date":"2022-01-14","type":"Introduced","type_id":1,"mime":"text\/html","mime_id":1,"url":"https:\/\/legiscan.com\/VA\/text\/HB1157\/id\/2609661","state_link":"https:\/\/lis.virginia.gov\/cgi-bin\/legp604.exe?231+ful+HB1157+hil","text_size":11854,"text_hash":"7b8b1dd6743814ee88c757528b610fb1"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}