{"bill":{"bill_id":1650048,"change_hash":"6e49520394effa8ee3e15c91cd3149c2","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/HB1188\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1188\/","completed":0,"status":1,"status_date":"2023-01-10","progress":[{"date":"2023-01-10","event":1},{"date":"2023-01-10","event":9}],"state":"IN","state_id":14,"bill_number":"HB1188","bill_type":"B","bill_type_id":"1","body":"H","body_id":37,"current_body":"H","current_body_id":37,"title":"Compliance with CHINS dispositional decrees.","description":"Compliance with CHINS dispositional decrees. Provides that if the department of child services (department) takes a child into custody, the department may not release the child to the child's parent, guardian, or custodian if: (1) the parent, guardian, or custodian, or a household member of the parent, guardian, or custodian, is the subject of a substantiated allegation of abuse of a child; and (2) the child expresses a desire to not be released to the parent, guardian, or custodian; and may not allow the parent, guardian, or custodian to have contact with the child until: (A) the child consents to contact with the parent, guardian, or custodian; or (B) the child's child in need of services case is closed; whichever occurs first. Provides that if a dispositional decree requires a child's parent, guardian, or custodian to participate in a program of care, treatment, or rehabilitation and the court finds that the parent, guardian, or custodian has failed to make consistent and timely progress toward the goals set forth in the dispositional decree, the department: (1) may not return the child to the home of the parent, guardian, or custodian; and (2) may not allow the parent, guardian, or custodian in person contact with the child unless the contact is approved as being in the child's best interest by: (A) a court appointed special advocate or guardian ad litem; and (B) a licensed marriage and family therapist, if one has been appointed for the child; until the court finds that the parent, guardian, or custodian is making consistent and timely progress toward the goals set forth in the dispositional decree. Provides that if, in a 12 month periodic case review for a child in need of services, the court finds that the child's parent, guardian, or custodian has failed to make consistent and timely progress in any service that was ordered by the court and that was made available to the parent, guardian, or custodian by the department, the court shall order: (1) that the permanency plan for the child be changed to a concurrent plan in which at least one intended permanency arrangement is not reunification; or (2) that the intended permanency arrangement for the child be changed to placement of the child for adoption. Provides: (1) that in a 15 month periodic case review for a child in need of services, the court shall order: (A) that the permanency plan for the child be changed to a concurrent plan in which at least one intended permanency arrangement is not reunification; or (B) that the intended permanency arrangement for the child be changed to placement of the child for adoption; and (2) that thereafter, the intended permanency arrangement for the child may not be changed to solely reunification. Amends and adds to the conditions under which reasonable efforts to reunify a child with the child's parent, guardian, or custodian, or preserve a child's family, are not required. Provides that: (1) if a parent, guardian, or custodian of a child in need of services is involuntarily discharged three or more times from a program or service in which the parent, guardian, or custodian is required to participate under the child's dispositional decree, the court may order the parent, guardian, or custodian to pay the cost of subsequent participation in the program or service; and (2) if the dispositional decree requires the parent, guardian, or custodian to submit to drug testing and the parent, guardian, or custodian: (A) tests positive for a controlled substance; or (B) fails to submit to a required drug test; three or more times, the court may order the parent, guardian, or custodian to pay the cost of any subsequent drug testing required under the dispositional decree. Establishes conditions under which a parent's consent to termination of the parent's parent-child relationship with respect to a child is implied without further action of the court, and provides that the parent's implied consent is a factor weighing in favor of terminating the parent's relationship with the child. Provides that a court finding that a parent has failed to make consistent and timely progress in any service that was ordered by the court in a dispositional decree and that was made available to the parent by the department is a factor weighing in favor of terminating the parent's relationship with the child. Requires termination of the parent-child relationship with regard to a child who is: (1) taken into custody; and (2) adjudicated a child in need of services; on two separate occasions in a two year period. Provides, for purposes of a petition to terminate the parent-child relationship, that: (1) the court finding that there is a satisfactory plan for the care and treatment of the child, and that the plan is in the child's best interests, is a factor weighing in favor of terminating the parent-child relationship; and (2) if the intended permanency arrangement for the child is placement of the child for adoption, a specific adoptive home need not have been identified in order for the plan to be satisfactory or in the child's best interests.","pending_committee_id":1296,"committee":{"committee_id":1296,"chamber":"H","chamber_id":37,"name":"Judiciary"},"referrals":[{"date":"2023-01-10","committee_id":1296,"chamber":"H","chamber_id":37,"name":"Judiciary"}],"history":[{"date":"2023-01-10","action":"Authored by Representative Lauer","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-01-10","action":"First reading: referred to Committee on Judiciary","chamber":"H","chamber_id":37,"importance":1},{"date":"2023-01-12","action":"Representatives Schaibley and Olthoff added as coauthors","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-01-12","action":"Representative Jackson added as coauthor","chamber":"H","chamber_id":37,"importance":0}],"sponsors":[{"people_id":20210,"person_hash":"2l5c8uuy","party_id":"2","state_id":14,"party":"R","role_id":1,"role":"Rep","name":"Ryan Lauer","first_name":"Ryan","middle_name":"","last_name":"Lauer","suffix":"","nickname":"","district":"HD-059","ftm_eid":7281702,"votesmart_id":130810,"opensecrets_id":"","knowwho_pid":486777,"ballotpedia":"Ryan_Lauer","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":16801,"person_hash":"4ah04ilc","party_id":"2","state_id":14,"party":"R","role_id":1,"role":"Rep","name":"Donna Schaibley","first_name":"Donna","middle_name":"","last_name":"Schaibley","suffix":"","nickname":"","district":"HD-024","ftm_eid":6982379,"votesmart_id":156198,"opensecrets_id":"","knowwho_pid":521995,"ballotpedia":"Donna_Schaibley","bioguide_id":"","sponsor_type_id":2,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":16702,"person_hash":"rq4ygpky","party_id":"2","state_id":14,"party":"R","role_id":1,"role":"Rep","name":"Julie Olthoff","first_name":"Julie","middle_name":"","last_name":"Olthoff","suffix":"","nickname":"","district":"HD-019","ftm_eid":21078191,"votesmart_id":149618,"opensecrets_id":"","knowwho_pid":486738,"ballotpedia":"Julie_Olthoff","bioguide_id":"","sponsor_type_id":2,"sponsor_order":3,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20011,"person_hash":"8t48vq76","party_id":"1","state_id":14,"party":"D","role_id":1,"role":"Rep","name":"Carolyn Jackson","first_name":"Carolyn","middle_name":"B.","last_name":"Jackson","suffix":"","nickname":"","district":"HD-001","ftm_eid":44858020,"votesmart_id":178082,"opensecrets_id":"","knowwho_pid":654975,"ballotpedia":"Carolyn_Jackson","bioguide_id":"","sponsor_type_id":2,"sponsor_order":4,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":362914,"subject_name":"CHILDREN AND MINORS, Department of Child Services"},{"subject_id":363057,"subject_name":"CHILDREN AND MINORS, Child Support, Custody, and Visitation"}],"texts":[{"doc_id":2629947,"date":"2023-01-10","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/HB1188\/id\/2629947","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1188\/#1.INTR","text_size":317184,"text_hash":"f326064fc80d332edd1cc8ea51a7233a"}],"votes":[],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2023-02-01","time":"08:30","location":"Room 156-B","description":"House Judiciary Hearing"}]}}