{"bill":{"bill_id":1649531,"change_hash":"26c1aead0168cf21e3a00ae776c3eee8","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/HB1151\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1151\/","completed":0,"status":1,"status_date":"2023-01-10","progress":[{"date":"2023-01-10","event":1},{"date":"2023-01-10","event":9}],"state":"IN","state_id":14,"bill_number":"HB1151","bill_type":"B","bill_type_id":"1","body":"H","body_id":37,"current_body":"H","current_body_id":37,"title":"Discriminatory appraisal practices.","description":"Discriminatory appraisal practices. Adds the following to the duties of the homeowner protection unit (unit) of the office of the attorney general: (1) Cooperating with law enforcement agencies in investigating violations of the federal Fair Housing Act. (2) Investigating and enforcing: (A) existing law prohibiting improperly influencing the preparation of a real estate appraisal; and (B) the bill's provisions prohibiting discriminatory practices in the appraisal of residential real property. Prohibits a person whose business includes appraising residential real property from making an excessively low appraisal of the value of real estate that is the subject of a mortgage loan on the basis of the race, color, religion, sex, disability, familial status, or national origin of: (A) the loan applicant; or (B) residents of the neighborhood in which the real estate is located. Establishes the fair housing practices fund (fund), to be administered by the Indiana housing and community development authority (authority), for the purpose of: (1) providing down payment assistance, financial assistance for closing costs, and restitution for individuals injured by a violation the bill's provisions prohibiting discriminatory appraisal practices; and (2) providing grants for: (A) community education and outreach efforts; and (B) community reinvestment initiatives; for neighborhoods or communities adversely impacted by the prohibited discriminatory appraisal practices. Requires the authority to adopt rules to develop certain criteria and procedures necessary to: (1) administer the fund; and (2) provide assistance from the fund. Requires the unit to: (1) amend the form that creditors are required to provide to mortgage loan applicants to include information about how prospective borrowers can report suspected violations of the bill's provisions prohibiting discriminatory appraisal practices; and (2) accept complaints concerning these suspected violations. Provides that a person that knowingly or intentionally violates the bill's provisions prohibiting discriminatory appraisal practices: (1) commits an act that is actionable by an aggrieved individual and the attorney general under the deceptive consumer sales act; and (2) is liable for a civil penalty. Provides that any civil penalty collected shall be deposited in the fund. Requires the real estate appraiser licensure and certification board (board) to, not later than January 1, 2024, submit recommendations to the Indiana real estate commission (commission) concerning the following: (1) Rules requiring as a condition of initial licensure or certification at least one hour of instruction in cultural competency training, and at least one hour of instruction in implicit bias training. (2) Rules requiring as a condition of renewal for licensure and certification at least one hour of continuing education instruction in cultural competency training, and at least one hour of continuing education instruction in implicit bias training. (3) Policies to foster diversity in the real estate appraisal profession. Requires the commission to adopt the recommended rules not later than July 1, 2024. Provides that the office of the attorney general and the professional licensing agency (agency) may use an existing investigative fund to investigate and enforce: (1) existing law prohibiting improperly influencing the preparation of a real estate appraisal; and (2) the bill's provisions prohibiting discriminatory appraisal practices. Requires the board to submit, on at least a quarterly basis, a request to the attorney general for certain information concerning complaints filed against real estate appraisers. Requires the agency to publish and update on the board's web page, on at least a quarterly basis, certain data received by the board in the most recent quarterly report from the attorney general. Beginning in 2025, requires the agency to submit an annual report to the legislative council concerning: (1) the cultural competency and implicit bias training educational requirements adopted by the commission; and (2) the policies to foster diversity in the real estate appraisal profession implemented by the commission.","pending_committee_id":1292,"committee":{"committee_id":1292,"chamber":"H","chamber_id":37,"name":"Financial Institutions"},"referrals":[{"date":"2023-01-10","committee_id":1292,"chamber":"H","chamber_id":37,"name":"Financial Institutions"}],"history":[{"date":"2023-01-10","action":"Authored by Representative Pryor","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-01-10","action":"First reading: referred to Committee on Financial Institutions","chamber":"H","chamber_id":37,"importance":1}],"sponsors":[{"people_id":5543,"person_hash":"1bb9qtmc","party_id":"1","state_id":14,"party":"D","role_id":1,"role":"Rep","name":"Cherrish Pryor","first_name":"Cherrish","middle_name":"S.","last_name":"Pryor","suffix":"","nickname":"","district":"HD-094","ftm_eid":6488685,"votesmart_id":72993,"opensecrets_id":"","knowwho_pid":201620,"ballotpedia":"Cherrish_Pryor","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[],"texts":[{"doc_id":2629577,"date":"2023-01-09","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/HB1151\/id\/2629577","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1151\/#1.INTR","text_size":333551,"text_hash":"fcebaa2bd3a6dc8ee8ce92b1aa002578"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}