{"bill":{"bill_id":1650045,"change_hash":"d5d5177b9229a90d39bae8a2b194366a","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/HB1218\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1218\/","completed":0,"status":1,"status_date":"2023-01-10","progress":[{"date":"2023-01-10","event":1},{"date":"2023-01-10","event":9}],"state":"IN","state_id":14,"bill_number":"HB1218","bill_type":"B","bill_type_id":"1","body":"H","body_id":37,"current_body":"H","current_body_id":37,"title":"Environmental scrutiny before property transfer.","description":"Environmental scrutiny before property transfer. Provides that, after June 30, 2024, the following apply: (1) If a dwelling for sale is connected to a residential onsite sewage system, the system must be inspected by a qualified inspector; if the inspection indicates that the system is failing, the sales disclosure form that an owner is required under current law to submit to a prospective buyer must disclose that the system has been inspected and the qualified inspector determined that the system exhibited one or more of the conditions constituting system failure; and a failure of the dwelling owner to satisfy this requirement makes transfer of ownership of the dwelling voidable at the election of the buyer, even after the closing. (2) Before a fee simple interest in a nondwelling structure connected to a commercial onsite sewage system may be transferred, the system must be inspected by a qualified inspector; a document disclosing the results of the inspection must be provided to the local health department, the county recorder, and the transferee; if the inspection discloses any condition constituting system failure, the transferee must present to the county recorder an affidavit stating that the cause of the system failure has been eliminated or will be eliminated before the transferee uses the nondwelling structure for the transferee's intended purpose; the county recorder may not record a deed transferring the fee simple interest in the nondwelling structure unless these requirements are satisfied; and a failure of the  nondwelling structure owner to provide the required document is a complete defense to an action for breach of a contract to purchase the nondwelling structure and is a breach of a legal duty for which the transferee may bring a civil action for compensatory damages. (3) Before a fee simple interest in a lot containing both a water well and a dwelling connected to a residential onsite sewage system or a  nondwelling structure connected to a commercial onsite sewage system may be transferred, water from the water well must be tested by a qualified tester for the presence of arsenic, nitrate, lead, and coliform bacteria; a document certifying that the testing has been conducted and setting forth the results of the testing must be provided to the local health department, the county recorder, and the transferee; the county recorder may not record a deed transferring the fee simple interest in the lot unless the recorder is presented this document; and a failure of the lot owner to provide the required document is a complete defense to an action for breach of a contract to purchase the lot and is a breach of a legal duty for which the transferee may bring a civil action for compensatory damages. Makes certain exceptions. Requires the state department of health to adopt rules to: (1) establish requirements and standards for the inspection of residential onsite sewage systems and commercial onsite sewage systems and the testing of well water; and (2) establish qualifications for inspectors of residential onsite sewage systems and commercial onsite sewage systems and testers of well water.","pending_committee_id":1290,"committee":{"committee_id":1290,"chamber":"H","chamber_id":37,"name":"Environmental Affairs"},"referrals":[{"date":"2023-01-10","committee_id":1290,"chamber":"H","chamber_id":37,"name":"Environmental Affairs"}],"history":[{"date":"2023-01-10","action":"Authored by Representative Aylesworth","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-01-10","action":"First reading: referred to Committee on Environmental Affairs","chamber":"H","chamber_id":37,"importance":1}],"sponsors":[{"people_id":16530,"person_hash":"z5or8e1m","party_id":"2","state_id":14,"party":"R","role_id":1,"role":"Rep","name":"Micheal Aylesworth","first_name":"Micheal","middle_name":"","last_name":"Aylesworth","suffix":"","nickname":"Mike","district":"HD-011","ftm_eid":21078183,"votesmart_id":149616,"opensecrets_id":"","knowwho_pid":486730,"ballotpedia":"Michael_J._Aylesworth","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":362743,"subject_name":"PROPERTY"},{"subject_id":362776,"subject_name":"ENVIRONMENT generally"},{"subject_id":363156,"subject_name":"BUILDINGS AND BUILDING REGULATIONS"}],"texts":[{"doc_id":2629944,"date":"2023-01-10","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/HB1218\/id\/2629944","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1218\/#1.INTR","text_size":295821,"text_hash":"92e5cea79a9c87638b55875282d4829a"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}