{"bill":{"bill_id":1654514,"change_hash":"1532028cbc397bb45658ba4548ecfce7","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/HB1296\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1296\/","completed":0,"status":1,"status_date":"2023-01-11","progress":[{"date":"2023-01-11","event":1},{"date":"2023-01-11","event":9}],"state":"IN","state_id":14,"bill_number":"HB1296","bill_type":"B","bill_type_id":"1","body":"H","body_id":37,"current_body":"H","current_body_id":37,"title":"Physical custody and parenting time.","description":"Physical custody and parenting time. Adds a rebuttable presumption in child custody proceedings that: (1) joint physical custody is in the best interests of the child; and (2) equal parenting time is in the best interests of the child. Provides that a court, in determining custody of a child, shall consider evidence that relocation of the child to an area outside the jurisdiction of the court is not in the child's best interests, unless written consent to the relocation is provided to the court by: (1) both parents of the child; and (2) the child's de facto custodian, if the court finds that the child has been cared for by a de facto custodian. Provides that the default joint physical custody or parenting time schedule is to alternate weekly physical custody of the child, unless the parents submit an alternative schedule that is approved by the court. Provides that a noncustodial parent is entitled to reasonable parenting time rights unless the court finds by clear and convincing evidence that parenting time might: (1) endanger the child's physical health and well-being; or (2) significantly impair the child's emotional development. Provides that if a court finds that granting parenting time to a noncustodial parent is not in the child's best interests, the court shall document the court's findings of fact and conclusions in writing and provide the written findings and conclusions to: (1) both parents of the child; and (2) the de facto custodian of the child, if the court finds that the child has been cared for by a de facto custodian. Provides that a court shall not restrict a parent's parenting time rights unless the court finds by clear and convincing evidence that the parenting time might endanger the child's physical health or significantly impair the child's emotional development. Provides that a court shall (rather than may, under current law) provide in a parenting time order or modification of a parenting time order for a security, bond, or other guarantee to secure enforcement of the parenting time order. Provides that a noncustodial parent may make up parenting time missed as the result of: (1) the noncustodial parent's: (A) active deployment in the armed forces of the United States; (B) active service in a state, county, or local law enforcement agency; (C) active service in a fire department; or (D) employment related trips or training; or (2) other factors the court considers to have directly impeded participation of the parent in parenting time. Provides that a noncustodial parent who is barred by a custodial parent from exercising parenting time rights granted to the noncustodial parent by a court may file for an injunction against the custodial parent in a court that has jurisdiction over a child custody proceeding with regard to the child. Provides that if a court: (1) issues an injunction or temporary restraining order with regard to a custodial parent's denial of court ordered parenting time to the child's noncustodial parent; and (2) finds that the custodial parent has, without justifiable cause, violated the injunction or temporary restraining order; the court may modify custody of the child.","pending_committee_id":1296,"committee":{"committee_id":1296,"chamber":"H","chamber_id":37,"name":"Judiciary"},"referrals":[{"date":"2023-01-11","committee_id":1296,"chamber":"H","chamber_id":37,"name":"Judiciary"}],"history":[{"date":"2023-01-11","action":"Authored by Representative VanNatter","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-01-11","action":"First reading: referred to Committee on Judiciary","chamber":"H","chamber_id":37,"importance":1}],"sponsors":[{"people_id":10577,"person_hash":"cnbnqyvb","party_id":"2","state_id":14,"party":"R","role_id":1,"role":"Rep","name":"Heath VanNatter","first_name":"Heath","middle_name":"","last_name":"VanNatter","suffix":"","nickname":"","district":"HD-038","ftm_eid":6682164,"votesmart_id":109780,"opensecrets_id":"","knowwho_pid":265369,"ballotpedia":"Heath_VanNatter","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":363057,"subject_name":"CHILDREN AND MINORS, Child Support, Custody, and Visitation"},{"subject_id":363034,"subject_name":"CHILDREN AND MINORS, Juvenile Courts and Proceedings"},{"subject_id":363058,"subject_name":"COURTS generally"},{"subject_id":362747,"subject_name":"MARRIAGE AND FAMILY LAW"},{"subject_id":362819,"subject_name":"MILITARY FORCES"},{"subject_id":362729,"subject_name":"LAW ENFORCEMENT generally"},{"subject_id":363368,"subject_name":"LAW ENFORCEMENT, State Police"},{"subject_id":363431,"subject_name":"LAW ENFORCEMENT, City Police"},{"subject_id":363493,"subject_name":"LAW ENFORCEMENT, County Sheriffs and Sheriffs' Departments"},{"subject_id":362939,"subject_name":"FIRE DEPARTMENTS AND DISTRICTS"},{"subject_id":362907,"subject_name":"LAW ENFORCEMENT, Academy and Training"},{"subject_id":363054,"subject_name":"CRIMES AND OFFENSES, Criminal Courts and Court Procedures"}],"texts":[{"doc_id":2634775,"date":"2023-01-11","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/HB1296\/id\/2634775","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1296\/#1.INTR","text_size":206108,"text_hash":"6bffc7da03c216fb913c345eb644c55a"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}