{"bill":{"bill_id":1660529,"change_hash":"add50be03f90c2c71517b626b422f5a4","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/HB1336\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1336\/","completed":0,"status":2,"status_date":"2023-02-15","progress":[{"date":"2023-01-17","event":1},{"date":"2023-01-17","event":9},{"date":"2023-02-09","event":10},{"date":"2023-02-15","event":2}],"state":"IN","state_id":14,"bill_number":"HB1336","bill_type":"B","bill_type_id":"1","body":"H","body_id":37,"current_body":"H","current_body_id":37,"title":"Various election law matters.","description":"Various election law matters. Adds the U.S. Space Force to the definition of \"uniformed services\" in election law. Provides that electronic signatures may be used for the reporting of campaign contributions and expenditures. Provides that election form approval procedures do not apply to a form incorporated only into the statewide voter registration system. Makes other technical changes relating to approval of election forms. Provides that a statute prohibiting the use of the circuit court clerk's name on a ballot if the clerk is a candidate for an office on the ballot does not apply if the only office for which the individual is a candidate is a political party office. Requires a candidate to specify on the candidate's candidacy document each designation that the candidate wants to use on the ballot. Requires the election division to design all candidacy documents so that the form of the document enables the candidate to insert in a separate field of the document each of the separate designations that a candidate is permitted to use under election law. Provides that an individual is considered to have resigned as an elected official of a unit when the person becomes an employee of the unit the individual serves as an elected official. Provides that certain mailings required by election law be sent by first class mail with tracking rather than by certified mail. Provides that a statute that permits removal and fining of a precinct election officer who fails to perform duties is applicable to an absentee voter board member and to an absentee ballot counter. Authorizes a county election board to permit individuals who are candidates for certain political party offices and relatives of such individuals to serve as precinct election officers if the county election board finds that enough individuals are not available to serve as precinct election officers. Requires the bureau of motor vehicles commission to forward the voter registration part of an application and any declination to register to the election division for transmittal to the appropriate county voter registration office. Adds law enforcement agencies that receive voter registrations to the list of voter registration agencies that are not subject to certain requirements relating to filing voter registration applications. Provides that the statewide voter registration system must contain a feature that identifies potential nonresidential addresses submitted on voter registration applications. Provides additional procedures for updating a copy of a voter's original signature in the statewide voter registration file. Adds judges of city and town courts to the list of officials that must file a statement of economic interest before filing a candidacy document. Provides that an officeholder is not entitled to salary until a statement of economic interest is filed, if required. Provides that, for purposes of determining whether a candidate is affiliated with a particular major political party, the candidate must have voted in that party's two most recent primary elections. (Under current law, a candidate is required to have voted in the political party's most recent primary election.) Provides that if an election district is included entirely within one precinct, and does not include the entire precinct, the petition of nomination must be signed by at least five voters of the election district. Provides that if a special election to fill a vacancy in the office of United States Representative is held on the same day of the election to elect the individual to serve in the succeeding term, an individual may appear on the ballot as a candidate in both elections. Provides that in such an election for United States Representative, the ballot must list the election to fill the office vacancy immediately after the election for the next term of the office. Requires the chair of a political committee to file a final report for a treasurer if the treasurer has died or is otherwise unable to file the report. Provides that the statute requiring reporting of \"large\" campaign contributions does not require the reporting of a contribution unless it is accepted by the candidate's candidate committee. Provides language for printing on ballots when no candidate has filed for the office. Eliminates the requirement that counties send duplicate copies of state election returns to the election division. Provides that a county executive is not required to establish precincts so that a precinct contains not more than 2,000 active voters or 2,300 active voters if the precinct is in a county designated as a vote center county. Provides that in addition to precinct boundaries, the name of a precinct as included in the federal decennial census data becomes the official name of the precinct. Requires that a ballot be arranged so that all candidates for the same office appear on the same page or the same screen. Provides procedures for ballot layout when a candidate dies or is no longer eligible to appear on the ballot. Requires a circuit court clerk who receives an absentee ballot application from a voter who is not registered to vote in the county to send the application to the circuit court clerk of the county in which the voter is registered. Provides that the designation of a voter as an absent uniformed services voter, an overseas voter, or a voter with print disabilities expires January 1 after such a voter has submitted an absentee ballot application indicating such designation. Provides that, after December 31, 2024, all absentee ballots must be printed on security paper that incorporates features that can be used to authenticate the ballot. Provides that a voter must file residence documentation before 6 p.m. on election day. Provides that only the individuals who are permitted to be in the polls on election day are permitted to be in the room where early absentee voting is occurring. Provides that a county election board may send a signed form from a public test to the election division by electronic mail or fax. Provides that instructions posted in a voting booth or on a marking device may include instructions regarding straight party voting. Provides that an application fee for certification of a voting system does not apply if the application is for a de minimis change. Requires absentee ballot counters to begin counting absentee ballots beginning at 6:00 a.m. on election day if certain conditions are met. Provides that if there is a discrepancy on political party primary ballot choice between the federal write-in absentee ballot and the federal post card application, the federal post card application supersedes the federal write-in absentee ballot. Provides that if an individual who holds a local office is elected to another term in that office and subsequently dies or is disqualified before the next term is scheduled to begin, a vacancy is created that must be filled as otherwise provided by law. Adjusts the schedule for conducting a post-election audit if a contest or recount has been filed affecting the county. Provides that a notice of death of a local office holder is required to be filed only with the circuit court clerk. (Under current law, notice must also be filed with the prosecuting attorney.) Exempts a member of a fiscal or legislative body from assuming certain duties during a vacancy. Requires a magistrate to deposit a copy of the magistrate's oath in the office of the circuit court clerk of the county in which the magistrate resides or serves. Requires the certification of a question on a referendum to occur not later than noon 74 days before a special election. Provides that a personal representative of a decedent who was a treasurer or candidate for office may disband the committee associated with the decedent's office or campaign. Removes references to \"independent tickets\" in election law. Makes several other technical changes. Repeals the law concerning the affidavit eligibility of a precinct election officer.","pending_committee_id":0,"committee":[],"referrals":[{"date":"2023-01-17","committee_id":1289,"chamber":"H","chamber_id":37,"name":"Elections and Apportionment"}],"history":[{"date":"2023-01-17","action":"Authored by Representative Wesco","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-01-17","action":"First reading: referred to Committee on Elections and Apportionment","chamber":"H","chamber_id":37,"importance":1},{"date":"2023-02-09","action":"Committee report: amend do pass, adopted","chamber":"H","chamber_id":37,"importance":1},{"date":"2023-02-13","action":"Second reading: ordered engrossed","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-02-13","action":"Representative Pfaff added as coauthor","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-02-14","action":"Senate sponsor: Senator Ford Jon","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-02-14","action":"Third reading: passed; Roll Call 128: yeas 91, nays 0","chamber":"H","chamber_id":37,"importance":0},{"date":"2023-02-15","action":"Referred to the Senate","chamber":"H","chamber_id":37,"importance":1}],"sponsors":[{"people_id":11394,"person_hash":"7zkzxz3b","party_id":"2","state_id":14,"party":"R","role_id":1,"role":"Rep","name":"Timothy Wesco","first_name":"Timothy","middle_name":"","last_name":"Wesco","suffix":"","nickname":"","district":"HD-021","ftm_eid":6682118,"votesmart_id":120359,"opensecrets_id":"","knowwho_pid":289907,"ballotpedia":"Timothy_Wesco","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":20385,"person_hash":"zt2nzhlt","party_id":"1","state_id":14,"party":"D","role_id":1,"role":"Rep","name":"Tonya Pfaff","first_name":"Tonya","middle_name":"","last_name":"Pfaff","suffix":"","nickname":"","district":"HD-043","ftm_eid":44858080,"votesmart_id":178110,"opensecrets_id":"","knowwho_pid":655011,"ballotpedia":"Tonya_Pfaff","bioguide_id":"","sponsor_type_id":2,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":16532,"person_hash":"xbkmic1p","party_id":"2","state_id":14,"party":"R","role_id":2,"role":"Sen","name":"Jon Ford","first_name":"Jon","middle_name":"","last_name":"Ford","suffix":"","nickname":"","district":"SD-038","ftm_eid":21078152,"votesmart_id":148534,"opensecrets_id":"","knowwho_pid":484121,"ballotpedia":"Jon_Ford","bioguide_id":"","sponsor_type_id":3,"sponsor_order":3,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":362775,"subject_name":"ELECTIONS generally"},{"subject_id":362893,"subject_name":"ELECTIONS, Conduct of Elections"},{"subject_id":362894,"subject_name":"SECRETARY OF STATE"},{"subject_id":362729,"subject_name":"LAW ENFORCEMENT generally"},{"subject_id":367334,"subject_name":"ELECTIONS, Precincts and Precinct Committeemen"},{"subject_id":362737,"subject_name":"MOTOR VEHICLES, Bureau of Motor Vehicles, License Branches"},{"subject_id":362752,"subject_name":"ELECTIONS, Voters and Voting; Registration"},{"subject_id":364074,"subject_name":"ELECTIONS, Absent Voters"},{"subject_id":363410,"subject_name":"ELECTIONS, Political Parties"},{"subject_id":362900,"subject_name":"TECHNOLOGY"},{"subject_id":362826,"subject_name":"AUDITS AND AUDITORS"},{"subject_id":364068,"subject_name":"CIRCUIT COURTS AND COURT OFFICERS"},{"subject_id":363007,"subject_name":"TREASURERS"}],"texts":[{"doc_id":2642407,"date":"2023-01-17","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/HB1336\/id\/2642407","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1336\/#1.INTR","text_size":815075,"text_hash":"ad47155c19d2733362a2f845e1674d6c"},{"doc_id":2691346,"date":"2023-02-09","type":"Amended","type_id":3,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/HB1336\/id\/2691346","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1336\/#2.COMH","text_size":3334505,"text_hash":"d9366a1b42336909692b840922c789a9"}],"votes":[{"roll_call_id":1250376,"date":"2023-02-14","desc":"House - Third reading","yea":91,"nay":0,"nv":4,"absent":5,"total":100,"passed":1,"chamber":"H","chamber_id":37,"url":"https:\/\/legiscan.com\/IN\/rollcall\/HB1336\/id\/1250376","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/house\/1336\/#H128"}],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2023-01-25","time":"08:30","location":"Room 156-C","description":"House Elections and Apportionment Hearing"},{"type_id":1,"type":"Hearing","date":"2023-02-08","time":"08:30","location":"Room 156-C","description":"House Elections and Apportionment Hearing"},{"type_id":1,"type":"Hearing","date":"2023-02-08","time":"08:30","location":"Room 156-A","description":"House Elections and Apportionment Hearing"}]}}