{"bill":{"bill_id":1655686,"change_hash":"c354e6a5bb029557e42bd4558f3109d9","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/SB0360\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/360\/","completed":0,"status":1,"status_date":"2023-01-12","progress":[{"date":"2023-01-12","event":1},{"date":"2023-01-12","event":9}],"state":"IN","state_id":14,"bill_number":"SB0360","bill_type":"B","bill_type_id":"1","body":"S","body_id":38,"current_body":"S","current_body_id":38,"title":"Firearms matters.","description":"Firearms matters. Repeals the offense of unlawful carrying of a handgun. Makes it a Class A misdemeanor to carry a handgun without being licensed to carry a handgun. Specifies exceptions. Enhances the offense to a Level 5 felony in particular instances. Provides that a person who has been convicted of domestic battery may not possess or carry a handgun unless the right has been restored. Allows a person who is protected by a protection order and meets other requirements to carry a handgun without a license for 60 days after the protection order is issued. Provides that licenses to carry handguns are either qualified or unlimited and describes the distinction between the two. Specifies the burden of proof and grounds for dismissal for certain firearms offenses. Requires a person wishing to sell, trade, or transfer (transfer) a firearm to another person to transact the transfer through a dealer and provide the dealer with certain information. Specifies the background checks that a dealer must complete prior to the transaction. Permits a dealer to refuse to transact a firearm transfer. Requires a dealer to abort the transaction in other instances. Specifies requirements for a dealer who refuses to transact or aborts a firearm transfer. Makes a dealer immune from civil liability and damages in certain instances. Makes the offenses of firearm transfer fraud and the unlawful transfer of a firearm Level 6 felonies. Enhances both offenses in particular instances. Specifies exceptions and defenses. Requires a person to: (1) complete certain firearms safety training; and (2) present a certificate of completion of that training to a dealer; before purchasing a firearm. Prohibits a dealer from selling a firearm to a person who does not present a certificate of completion. Makes it a Class A misdemeanor for a: (1) dealer; (2) person approved to provide firearms training; or (3) prospective firearms purchaser; to commit certain offenses concerning a certificate of completion. Makes it a Class A misdemeanor for a dealer to fail to provide a safe storage device at the time of transacting a sale, trade, or transfer of a firearm. Provides that the prohibition on a political subdivision's regulation of certain matters concerning firearms does not apply to a county with a consolidated city. Defines terms. Makes conforming amendments and technical corrections.","pending_committee_id":2692,"committee":{"committee_id":2692,"chamber":"S","chamber_id":38,"name":"Corrections & Criminal Law"},"referrals":[{"date":"2023-01-12","committee_id":2692,"chamber":"S","chamber_id":38,"name":"Corrections & Criminal Law"}],"history":[{"date":"2023-01-12","action":"Authored by Senator Qaddoura","chamber":"S","chamber_id":38,"importance":0},{"date":"2023-01-12","action":"First reading: referred to Committee on Corrections and Criminal Law","chamber":"S","chamber_id":38,"importance":1}],"sponsors":[{"people_id":22275,"person_hash":"rox5xddw","party_id":"1","state_id":14,"party":"D","role_id":2,"role":"Sen","name":"Fady Qaddoura","first_name":"Fady","middle_name":"","last_name":"Qaddoura","suffix":"","nickname":"","district":"SD-030","ftm_eid":35240402,"votesmart_id":189631,"opensecrets_id":"","knowwho_pid":730706,"ballotpedia":"Fady_Qaddoura","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":363032,"subject_name":"CRIMES AND OFFENSES, Weapons"}],"texts":[{"doc_id":2636932,"date":"2023-01-12","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/SB0360\/id\/2636932","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/360\/#1.INTR","text_size":611276,"text_hash":"9a02ea7ce50830d8cf0ade9dd679ca74"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}