{"bill":{"bill_id":1665376,"change_hash":"d9e88240ac5f10da29405aee8059dae5","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/SB0429\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/429\/","completed":0,"status":1,"status_date":"2023-01-19","progress":[{"date":"2023-01-19","event":1},{"date":"2023-01-19","event":9}],"state":"IN","state_id":14,"bill_number":"SB0429","bill_type":"B","bill_type_id":"1","body":"S","body_id":38,"current_body":"S","current_body_id":38,"title":"Various firearms matters.","description":"Various firearms matters. Provides that a member of the firearm industry shall comply with certain firearm industry standards of conduct. Makes an act or omission by a member of the firearm industry in violation of these standards of conduct actionable by: (1) a person who has suffered harm in Indiana because of the member's conduct; (2) the attorney general; (3) a city attorney; and (4) a county attorney. Prohibits a licensed importer, licensed manufacturer, licensed dealer, or licensed collector from selling or delivering a: (1) firearm that is not a handgun to a person who is less than 21 years of age; or (2) semiautomatic assault weapon. Repeals the offense of unlawful carrying of a handgun. Makes it a Class A misdemeanor to carry a handgun without being licensed to carry a handgun. Specifies exceptions. Enhances the offense to a Level 5 felony in particular instances. Provides that a person who has been convicted of domestic battery may not possess or carry a handgun unless the right has been restored. Allows a person who is protected by a protection order and meets other requirements to carry a handgun without a license for 60 days after the protection order is issued. Provides that licenses to carry handguns are either qualified or unlimited and describes the distinction between the two. Specifies the burden of proof and grounds for dismissal for certain firearms offenses. Prohibits a person from keeping or storing an unsecured firearm on any premises controlled by the person under certain circumstances. Makes the failure to secure a firearm a Level 6 felony if the offense results in injury or death, enhances the offense to a Level 5 felony in particular instances, and provides a defense. Requires a person wishing to transfer a firearm to another person to transact the transfer through a firearms dealer (dealer), subject to certain exceptions, and specifies the procedure to be used by the dealer to effect the transfer. Grants a dealer civil immunity in certain circumstances. Provides that a person who makes a false statement to a dealer for the purpose of completing a transfer commits firearm transfer fraud, a Level 6 felony, and enhances the penalty in particular instances. Specifies that a dealer or other person who transfers a firearm in violation of certain requirements commits unlawful transfer of a firearm, a Level 6 felony, and enhances the offense to a Level 5 felony in particular instances. Defines terms. Makes conforming amendments and technical corrections.","pending_committee_id":2692,"committee":{"committee_id":2692,"chamber":"S","chamber_id":38,"name":"Corrections & Criminal Law"},"referrals":[{"date":"2023-01-19","committee_id":2692,"chamber":"S","chamber_id":38,"name":"Corrections & Criminal Law"}],"history":[{"date":"2023-01-19","action":"Authored by Senator Melton","chamber":"S","chamber_id":38,"importance":0},{"date":"2023-01-19","action":"First reading: referred to Committee on Corrections and Criminal Law","chamber":"S","chamber_id":38,"importance":1}],"sponsors":[{"people_id":17998,"person_hash":"6401vprj","party_id":"1","state_id":14,"party":"D","role_id":2,"role":"Sen","name":"Eddie Melton","first_name":"Eddie","middle_name":"","last_name":"Melton","suffix":"","nickname":"","district":"SD-003","ftm_eid":38525925,"votesmart_id":167444,"opensecrets_id":"","knowwho_pid":564942,"ballotpedia":"Eddie_Melton","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":363032,"subject_name":"CRIMES AND OFFENSES, Weapons"},{"subject_id":362934,"subject_name":"PROSECUTING ATTORNEYS"},{"subject_id":362786,"subject_name":"LICENSES AND LICENSING"},{"subject_id":363158,"subject_name":"CIVIL ACTIONS generally"}],"texts":[{"doc_id":2647151,"date":"2023-01-18","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/SB0429\/id\/2647151","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/429\/#1.INTR","text_size":815805,"text_hash":"890ec1a0daf8053ded187826977f5d63"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}