{"bill":{"bill_id":1665367,"change_hash":"0f4810c9e83f8710e8292cac23578570","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/SB0416\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/416\/","completed":0,"status":1,"status_date":"2023-01-19","progress":[{"date":"2023-01-19","event":1},{"date":"2023-01-19","event":9}],"state":"IN","state_id":14,"bill_number":"SB0416","bill_type":"B","bill_type_id":"1","body":"S","body_id":38,"current_body":"S","current_body_id":38,"title":"School and student safety information.","description":"School and student safety information. Provides that a law enforcement agency or private university police department shall, upon request of a school corporation, charter school, or nonpublic school, make available to the school corporation, charter school, or nonpublic school certain investigatory records regarding a person who is enrolled in the school corporation, charter school, or nonpublic school for the purpose of enhancing the safety or security of a student or school facility. Provides that if: (1) a child is adjudicated delinquent for an act that would be one of a specified list of offenses if committed by an adult (adult offense); and (2) the department of correction is awarded guardianship of the child; the department of correction shall, not later than 10 days before the child is paroled or discharged, provide notice of the child's parole or discharge to the administrator of the school or school district in which the child was most recently enrolled. Provides that a psychiatric crisis center, psychiatric inpatient unit, or psychiatric residential treatment provider shall (rather than may, under current law) disclose a patient's mental health record, without the patient's consent, to a school in which the patient is enrolled. Provides that the school may use the patient's mental health record only for the purposes of: (1) meeting the educational needs of the patient; or (2) ensuring the safety of the school. Provides that: (1) information concerning suspicious activity or potential criminal activity that relates to a child and that is shared between a law enforcement officer and a school corporation or certain other officials may be stored or maintained in a data base only for purposes of ensuring the safety and security of a student or facility of the school corporation; and (2) a school corporation may enter into a memorandum of understanding with a law enforcement agency to share such information. Requires the department of child services to coordinate annual meetings in each Indiana senate district and report specified information to each member of the senate regarding the meeting held in the senator's district. Provides that certain department of child services reports and materials shall be made available to a school official if disclosure is important to the school's development of a plan to: (1) provide a free and appropriate education to the student to whom the report or other material pertains; or (2) ensure the safety, health, or security of school students or employees. Requires the case plan of a child in need of services to: (1) include provisions to enable the child's school to: (A) provide appropriate support to and protect the safety of the child; and (B) protect the safety of the school; and (2) provide for participation in the case planning process by a department of education liaison. Provides that before releasing from custody a child who has been taken into custody for allegedly committing an adult offense, the department of child services shall notify the administrator of the child's school or school district of the child's pending release from custody, and specifies information that must be included in the notice. Provides that a juvenile court shall grant a school access to a requested portion of the juvenile court records of a child who is a student at the school: (1) if the request is made by specified school officials; and (2) under specified circumstances. Provides that a provider of mental health services has a duty to warn of, or take reasonable precautions to provide protection from, a patient's violent behavior, and is not immune from civil liability for failing to provide warning or take reasonable precautions, if the patient: (1) has communicated to the provider an actual threat of physical violence or other means of harm against a reasonably identifiable victim or victims; or (2) evidences conduct or makes statements indicating an imminent danger that the patient will use physical violence or use other means to cause serious personal injury or death to others.","pending_committee_id":1316,"committee":{"committee_id":1316,"chamber":"S","chamber_id":38,"name":"Education and Career Development"},"referrals":[{"date":"2023-01-19","committee_id":1316,"chamber":"S","chamber_id":38,"name":"Education and Career Development"}],"history":[{"date":"2023-01-19","action":"Authored by Senator Baldwin","chamber":"S","chamber_id":38,"importance":0},{"date":"2023-01-19","action":"First reading: referred to Committee on Education and Career Development","chamber":"S","chamber_id":38,"importance":1}],"sponsors":[{"people_id":21980,"person_hash":"hkf9wsvc","party_id":"2","state_id":14,"party":"R","role_id":2,"role":"Sen","name":"Scott Baldwin","first_name":"Scott","middle_name":"A.","last_name":"Baldwin","suffix":"","nickname":"","district":"SD-020","ftm_eid":48871339,"votesmart_id":189709,"opensecrets_id":"","knowwho_pid":730699,"ballotpedia":"Scott_Baldwin","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":362914,"subject_name":"CHILDREN AND MINORS, Department of Child Services"},{"subject_id":363034,"subject_name":"CHILDREN AND MINORS, Juvenile Courts and Proceedings"},{"subject_id":362774,"subject_name":"EDUCATION, Secretary of Education, State Department and Boards"},{"subject_id":362729,"subject_name":"LAW ENFORCEMENT generally"},{"subject_id":363005,"subject_name":"MENTAL HEALTH, Mentally Ill or Impaired Persons"},{"subject_id":362741,"subject_name":"SCHOOLS, Health and Safety Issues"},{"subject_id":362730,"subject_name":"LEGISLATIVE COUNCIL; LEGISLATIVE SERVICES AGENCY"}],"texts":[{"doc_id":2647142,"date":"2023-01-18","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/SB0416\/id\/2647142","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/416\/#1.INTR","text_size":436535,"text_hash":"d9e016bccecd10fa07fa00ed70a3e318"}],"votes":[],"amendments":[],"supplements":[],"calendar":[{"type_id":1,"type":"Hearing","date":"2023-02-15","time":"13:30","location":"Senate Chamber","description":"Senate Education and Career Development Hearing"}]}}