{"bill":{"bill_id":1665415,"change_hash":"3dc373ea3011c2c719421478b534dab8","session_id":2021,"session":{"session_id":2021,"state_id":14,"year_start":2023,"year_end":2023,"prefile":0,"sine_die":0,"prior":0,"special":0,"session_tag":"Regular Session","session_title":"2023 Regular Session","session_name":"2023 Regular Session"},"url":"https:\/\/legiscan.com\/IN\/bill\/SB0410\/2023","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/410\/","completed":0,"status":1,"status_date":"2023-01-19","progress":[{"date":"2023-01-19","event":1},{"date":"2023-01-19","event":9}],"state":"IN","state_id":14,"bill_number":"SB0410","bill_type":"B","bill_type_id":"1","body":"S","body_id":38,"current_body":"S","current_body_id":38,"title":"Juvenile law matters.","description":"Juvenile law matters. Repeals provisions providing that juvenile courts do not have jurisdiction over juveniles charged with certain offenses. Provides that a delinquent offender under 13 years of age (rather than 12 years of age, under current law) or 23 years of age or older (rather than 18 years of age or older, under current law) may not be committed to the department of correction. Provides that a delinquent offender's: (1) commitment to the department of correction; or (2) parole; may extend until the offender reaches 25 years of age if the offender has been adjudicated delinquent for an act that would have been a Level 3 felony, a Level 2 felony, a Level 1 felony, or murder if committed by an adult. Provides that a circuit or superior court has original and concurrent jurisdiction over a case alleging that an individual committed a delinquent act if: (1) the delinquent act is an act over which the circuit or superior court would have jurisdiction if the act had been committed by an adult; and (2) either: (A) the juvenile courts lack jurisdiction over the case; or (B) the juvenile court waives the case to the circuit or superior court. Provides that a juvenile court may waive a child to adult court for prosecution for certain offenses if the child was 16 years of age or older (rather than 14 years of age or older, under current law) when the child allegedly committed the offense. Provides that a juvenile court may waive a child to adult court for prosecution for a Level 1, Level 2, Level 3, Level 4, or Level 5 felony relating to controlled substances (rather than for any felony relating to controlled substances, under current law). Provides that a juvenile court may waive a child to adult court for prosecution for murder if the child was at least 14 years of age (rather than 12 years of age, under current law), but less than 16 years of age, when the child allegedly committed the offense. Amends the list of offenses for which a juvenile court is required to waive a child to adult court upon motion of the prosecutor. Amends alternative sentencing provisions, under which a juvenile tried in adult court may be sentenced to a juvenile facility, to: (1) provide that a juvenile sentenced under the alternative sentencing provisions may be held in a juvenile facility until the juvenile becomes 25 years of age; (2) provide for court review of the juvenile's progress once the department of correction notifies the sentencing court that the juvenile has successfully completed a rehabilitation program or has served 18 months in the juvenile facility, whichever comes first; and (3) provide that if, after the court review, the court continues the juvenile's placement in a juvenile facility, the court shall conduct a review hearing at least once every 180 days until the objectives of the sentence have been met or the juvenile becomes 25 years of age, whichever occurs first. Provides that a child convicted of certain offenses may not be made a ward of the department of correction if the child is less than 13 years of age (rather than 12 years of age, under current law) or at least 23 years of age (rather than 18 years of age, under current law) at the time the child's dispositional decree is entered. Provides that: (1) a child who is at least 13 years of age and commits an act that would be murder if committed by an adult may be made a ward of the department of correction for a period that is not longer than seven years and that does not end later than the date the child becomes 25 years of age; and (2) a child who is at least 16 years of age and commits an act that would be one of several specified offenses if committed by an adult may be made a ward of the department of correction for a period that is not longer than five years and that does not end later than the date the child becomes 25 years of age. Provides: (1) a process under which a person convicted of an offense committed by the person when the person was less than 18 years of age may, not less than 15 years after the date of the conviction, petition a court for modification of the person's sentence; and (2) conditions under which a court may grant the petition. Provides that: (1) a person less than 18 years of age who, with a child who is younger than the person and less than 14 years of age, knowingly or intentionally performs or submits to sexual intercourse or other sexual conduct commits child sexual misconduct; and (2) the offense is a Class A misdemeanor, subject to enhancement","pending_committee_id":2692,"committee":{"committee_id":2692,"chamber":"S","chamber_id":38,"name":"Corrections & Criminal Law"},"referrals":[{"date":"2023-01-19","committee_id":2692,"chamber":"S","chamber_id":38,"name":"Corrections & Criminal Law"}],"history":[{"date":"2023-01-19","action":"Authored by Senator Glick","chamber":"S","chamber_id":38,"importance":0},{"date":"2023-01-19","action":"First reading: referred to Committee on Corrections and Criminal Law","chamber":"S","chamber_id":38,"importance":1},{"date":"2023-02-06","action":"Senator Ford Jon added as second author","chamber":"S","chamber_id":38,"importance":0}],"sponsors":[{"people_id":10585,"person_hash":"hqlm8zq7","party_id":"2","state_id":14,"party":"R","role_id":2,"role":"Sen","name":"Susan Glick","first_name":"Susan","middle_name":"C.","last_name":"Glick","suffix":"","nickname":"","district":"SD-013","ftm_eid":6700210,"votesmart_id":128689,"opensecrets_id":"","knowwho_pid":313085,"ballotpedia":"Susan_Glick","bioguide_id":"","sponsor_type_id":1,"sponsor_order":1,"committee_sponsor":0,"committee_id":0,"state_federal":0},{"people_id":16532,"person_hash":"xbkmic1p","party_id":"2","state_id":14,"party":"R","role_id":2,"role":"Sen","name":"Jon Ford","first_name":"Jon","middle_name":"","last_name":"Ford","suffix":"","nickname":"","district":"SD-038","ftm_eid":21078152,"votesmart_id":148534,"opensecrets_id":"","knowwho_pid":484121,"ballotpedia":"Jon_Ford","bioguide_id":"","sponsor_type_id":1,"sponsor_order":2,"committee_sponsor":0,"committee_id":0,"state_federal":0}],"sasts":[],"subjects":[{"subject_id":363034,"subject_name":"CHILDREN AND MINORS, Juvenile Courts and Proceedings"},{"subject_id":362934,"subject_name":"PROSECUTING ATTORNEYS"},{"subject_id":363054,"subject_name":"CRIMES AND OFFENSES, Criminal Courts and Court Procedures"}],"texts":[{"doc_id":2647192,"date":"2023-01-18","type":"Introduced","type_id":1,"mime":"application\/pdf","mime_id":2,"url":"https:\/\/legiscan.com\/IN\/text\/SB0410\/id\/2647192","state_link":"https:\/\/iga.in.gov\/legislative\/2023\/bills\/senate\/410\/#1.INTR","text_size":566726,"text_hash":"3c2d6e6e096229ef0fe3b65e96ad1c09"}],"votes":[],"amendments":[],"supplements":[],"calendar":[]}}